{"date":"2025-11-28","quote":"\"Heaven and earth will pass away,\" yet his words endure forever, said by the Lord.","quoteCitation":"Luke 21:33","firstReading":"Daniel recounts a cosmic vision: four great beasts rise from the sea, each distinct and terrifying, as the winds stir the waters. The scene shifts to the Ancient of Days seated in judgment, a heavenly court convened and the books opened. Judgment falls on the beasts, and one like a son of man approaches the Ancient One. He is granted everlasting dominion, glory, and kingship over all peoples, nations, and languages.","secondReading":"","psalmSummary":"The canticle from Daniel praises God as creator and ruler of all. It calls on the whole creation — heavens, angels, waters, sun and moon, stars, and every creature — to bless and exalt the Lord. The tone is universal and doxological, celebrating God’s steadfast reign and prompting all beings to acknowledge divine sovereignty and mercy.","gospelSummary":"Jesus uses the fig tree’s budding as a simple sign: when leaves appear, summer is near. He draws a parallel to the signs his listeners will observe, warning that when they occur the kingdom is at hand. He emphasizes the trustworthiness and permanence of his word amid passing things. The teaching presses disciples to discern the signs, remain alert, and anchor hope in the enduring reliability of Christ’s word rather than transient appearances.","saintReflection":"St. Catherine Labouré (Optional Memorial): Catherine Labouré (1806-1876), Daughter of Charity of St. Vincent de Paul in Paris, received visions from the Blessed Virgin Mary that led to the Miraculous Medal’s devotion.","dailyPrayer":"Lord God, you judge with wisdom and reign for ever. Give us eyes to read the signs you place before us and hearts that answer with trust. When the world seems unsettled, remind us that your word endures and your reign is sure. Through the intercession of the Blessed Virgin Mary and St. Catherine Labouré, grant us humble openness to your guidance and courage to live as your faithful witnesses. Keep us watchful, steady in hope, and generous in mercy until the fuller coming of your kingdom. Amen.","theologicalSynthesis":"The readings together present a vision of cosmic sovereignty and the certainty of God’s word. Daniel’s apocalyptic imagery depicts divine judgment and the bestowal of eternal kingship on the Son of Man; the psalm responds with universal praise of the Creator; Luke’s parable calls for discernment and trust in the permanence of Jesus’ word. St. Catherine’s life and Marian devotion exemplify receptive faith that trusts God’s providence. The theological thrust invites believers to live expectantly, responsibly, and confidently under Christ’s enduring word.","exegesis":"Context: Daniel 7 stands within the book’s courtly-apocalyptic section, where dreams and visions disclose God’s sovereignty amid political turmoil. The four beasts emerging from the sea symbolize successive empires or chaotic powers that threaten God’s people. Daniel frames history as a stage for divine judgment: human pretensions are temporary, and the final verdict comes from the Ancient of Days. The imagery of the courtroom and the opened books reinforces God’s role as just ruler who assesses and rectifies injustice.\n\nPsalm: The canticle from Daniel 3 (verses 75–81) shifts the focus from prophetic vision to communal praise. Rather than narrating judicial scenes, it summons all creation—heavens, angels, waters, celestial bodies, and living creatures—to bless the Lord. This cosmic liturgy complements Daniel’s apocalyptic tableau by locating the response to divine kingship in doxology. Creation’s vocation is to recognize and celebrate the Creator; the psalm thus universalizes the theological claim that God’s reign elicits an ordered and grateful response.\n\nGospel: In Luke 21:29–33 Jesus draws on simple natural observation to teach eschatological discernment. The fig tree’s leaves signal a coming season; so too, signs in human history announce the nearness of God’s reign. But Luke layers the pastoral with assurance: despite cosmic instability, the teaching asserts the permanence of the Savior’s word. The saying that heaven and earth will pass away but his words will not functions as a pivot: it promises continuity amid change and grounds the community’s hope in the trustworthiness of Christ rather than in ephemeral signs alone.\n\nSaints: St. Catherine Labouré’s presence on this day offers a concrete example of receptive discipleship. Her private, obedient openness to Marian revelation produced the Miraculous Medal, a sacramental instrument encouraging trust in divine mercy. Catherine’s experience shows how the transcendent themes of judgment, kingship, and eschatological hope become pastoral realities: the call to watchfulness and faithfulness takes shape as humility, prayer, and confidence in God’s providence embodied in Marian devotion and charitable service.\n\nInterpretation: Reading these texts together highlights a balance between alertness to signs and rooted confidence in God. Daniel’s dramatic vision warns that human powers are provisional; the psalm insists that praise is the appropriate communal response; Luke instructs the faithful to read signs without succumbing to anxiety because Christ’s word endures. Theologically, this resists an oscillation between fatalism and speculative eagerness about end-times while encouraging a sustained ethical posture: active fidelity now, grounded in the certainty of divine promise.\n\nToday: For contemporary believers the combined message invites a disciplined spirituality. We are asked to cultivate discernment—attentive to cultural and moral warnings—while anchoring hope in the unchanging promise of Christ. The example of St. Catherine urges lowliness and trust as responses to revelation. Liturgically and pastorally, these readings encourage communities to sustain prayerful watchfulness, to practice works of mercy, and to trust sacramental means that foster reliance on God’s enduring word until the fullness of his kingdom is revealed.","tags":["advent","eschatology","judgment","hope","watchfulness","st.-catherine-labouré","miraculous-medal","daniel","luke"],"usccbLink":"https://bible.usccb.org/bible/readings/112825.cfm","cycle":"Year A","weekdayCycle":"Cycle I","feast":"Optional Memorial","firstReadingRef":"Daniel 7:2-14","secondReadingRef":"","psalmRef":"Daniel 3:75, 76, 77, 78, 79, 80, 81","gospelRef":"Luke 21:29-33","lectionaryKey":"2025-11-28:Daniel 7:2-14||Daniel 3:75, 76, 77, 78, 79, 80, 81|Luke 21:29-33"}
