{"date":"2025-11-19","quote":"Hear a just cause, O LORD; attend to my cry!","quoteCitation":"Psalm 17:1 — USCCB","firstReading":"No first reading reference was provided for these submissions. The USCCB link supplied focuses on the Psalm and the Gospel for the day. Without an explicit first-reading citation, a faithful summary of a particular Old Testament or Prophetic reading cannot be given. Please supply a first-reading reference if you would like a concise summary tied to a specific lectionary text.","secondReading":"","psalmSummary":"Psalm 17:1 is a short, urgent appeal for vindication and attentive justice. The psalmist calls upon the Lord to hear a righteous case, to listen closely, and to act as defender. This single verse frames trust in God’s attentive care amid danger, injustice, or accusation, expressing confidence that God both hears and will intervene on behalf of the upright who seek refuge in him.","gospelSummary":"Luke 19:11-28 presents the parable of the minas, told as Jesus approaches Jerusalem. A nobleman goes away to receive royal authority and entrusts his servants with money, commanding them to trade with it until his return. On his return he calls them to account; those who invested and multiplied their minas are praised and given greater responsibility, while the one who hid his mina out of fear is rebuked and stripped of what he had. The crowd that opposed the nobleman is punished. The parable presses themes of stewardship, accountability, the expectation of active service in the kingdom, and the consequences of fear and inaction.","saintReflection":"No saint was specified for this entry. In light of the readings, one can reflect on the countless unnamed saints whose daily faithfulness exemplified stewardship: those who risked comfort and reputation to invest their gifts in service, prayer, and care for others. Their witness reminds us that holiness often looks like faithful, humble labor that bears fruit over time rather than immediate applause.","dailyPrayer":"Lord Jesus, you entrust your Church with gifts and call us to faithful stewardship. Grant us courage to invest our time, talents, and resources for your kingdom rather than hide them in fear. Teach us to labor faithfully until your return, to bear good fruit for others, and to welcome your judgment as a refining mercy. Defend the righteous and hear our cries for justice. Strengthen us to oppose apathy, to serve our neighbors with generosity, and to build communities of hope. Keep our hearts alert and our hands busy in loving service, so that at your coming we may hear your word, \"Well done.\" Through the Spirit, make us wise and steadfast. Amen.","theologicalSynthesis":"The Psalm and the Gospel together place the believer between petition and responsibility. The psalmist’s plea for God to hear the just cause highlights dependence on divine justice; the Gospel parable answers that dependence with a summons to active stewardship. The kingdom is both gift and task: God will vindicate and judge, but Christians are called to labor responsibly with gifts entrusted to them. Eschatological expectation (Christ’s return to receive his kingdom) transforms present activity into accountable service. Thus faith involves trust in God’s vindication and a disciplined, risk-taking commitment to build the reign of God now.","exegesis":"Context: Luke places the parable of the minas on the road to Jerusalem, where tensions about Jesus’ kingship heighten. Unlike Matthew’s talents, Luke’s version emphasizes a nobleman who temporarily departs to receive authority; the narrative setting associates the story with impending conflict over Jesus’ claim to a kingdom. The intended hearers—disciples and a curious crowd—are invited to see themselves as servants entrusted with responsibility in the interval before the nobleman’s return.\n\nPsalm: The single verse of Psalm 17:1 reads as a compact, fervent appeal: the speaker asks the LORD to hear a just cause and attend to his cry. That plea reflects the believer’s vulnerability before hostile forces and the conviction that ultimate justice belongs to God. The verse frames suffering within trust: the righteous appeal to God’s attentive action rather than merely human vindication.\n\nGospel: The parable’s structure is clear: a master departs, entrusting each servant with resources; on returning he calls them to account. The command to “do business till I come” (v. 13) commends energetic, responsible use of what is given. Rewards follow accurate stewardship; fear and inactivity are condemned. The punishment of the hostile citizens who reject the nobleman mirrors the fate of those who oppose God’s messianic claim. The narrative thus operates on multiple registers—individual accountability, communal response to kingship, and the social consequences of rejecting rightful authority.\n\nSaints: Although no specific saint is cited here, the parable has long shaped Christian formation and the witness of saints. Figures canonized for their generosity and fidelity often embodied the parable’s ideal: they risked comforts to multiply spiritual and material goods for the community. Martyrs and confessors who stood against hostile powers also model the refusal to trade the kingdom’s goods for safety. The lesson is communal: sanctity is not private serenity but engaged fidelity to the Master’s commission.\n\nToday: For contemporary readers the parable and the psalm together form a corrective to passivity. The psalm teaches dependence on God’s justice; the parable requires active cooperation in the Lord’s work. Practical applications stretch from prudent stewardship of finances to using one’s voice against injustice and investing in formation, charity, and evangelization. The warning against fearful hiding challenges believers to risk in service; the promise of accountability reframes success as faithfulness, not mere profit. Ultimately, the texts call the Church to live between petition and action—trusting God’s care while investing gifts for the life of the world.","tags":["psalm-17:1","luke-19:11-28","parable-of-the-minas","stewardship","accountability","ordinary-time"],"usccbLink":"https://bible.usccb.org/bible/readings/111925.cfm","cycle":"Year A","weekdayCycle":"Cycle I","feast":"","firstReadingRef":"","secondReadingRef":"","psalmRef":"Psalm 17:1","gospelRef":"Luke 19:11-28","lectionaryKey":"2025-11-19:||Psalm 17:1|Luke 19:11-28"}
