[
  {
    "date": "2025-07-26",
    "quote": "Then the righteous will shine like the sun in the kingdom of their Father. (Matthew 13:43)",
    "reading": "The righteous will shine like the sun; the parable of the weeds is explained.",
    "psalm": "Psalm 136 recounts God's enduring mercy and saving acts from creation to deliverance, urging Israel to give thanks.",
    "gospel": "Jesus explains the parable of the weeds, declaring that the righteous will be separated from the wicked at the end of time.",
    "prayer": "Lord, help us to grow as wheat in Your field. Make our lives fruitful and our faith resilient, that we may shine in Your kingdom forever. Amen."
  },
  {
    "date": "2025-07-27",
    "quote": "The kingdom of heaven is like a treasure buried in a field. (Matthew 13:44)",
    "reading": "Jesus teaches about the Kingdom through the parables of treasure and pearl.",
    "psalm": "Psalm 119 expresses love for God’s law as the true path to wisdom and life.",
    "gospel": "Jesus shares parables of treasure and pearl, revealing the surpassing value of the Kingdom and the cost of discipleship.",
    "prayer": "Lord, help us to seek Your Kingdom above all and to joyfully give everything to gain the treasure of eternal life. Amen."
  },
  {
    "date": "2025-07-28",
    "quote": "The Kingdom of heaven is like a mustard seed. (Matthew 13:31)",
    "reading": "The mustard seed and leaven reveal the hidden growth of God's Kingdom.",
    "psalm": "Psalm 124 proclaims that God is Israel’s protector, delivering them from overwhelming danger.",
    "gospel": "Jesus tells parables of the mustard seed and leaven, showing how God’s Kingdom grows from small beginnings into great things.",
    "prayer": "Heavenly Father, may our faith, though small, be planted in You and grow strong to shelter others in love. Amen."
  },
  {
    "date": "2025-07-29",
    "quote": "I am the resurrection and the life. (John 11:25)",
    "reading": "Jesus declares He is the resurrection and raises Lazarus.",
    "psalm": "Psalm 34 extols the Lord who rescues the brokenhearted and delivers the just from affliction.",
    "gospel": "Jesus proclaims Himself the resurrection and raises Lazarus, revealing divine power over death.",
    "prayer": "Jesus, our Resurrection and Life, raise our spirits from despair and strengthen our faith in Your victory over death. Amen."
  },
  {
    "date": "2025-07-30",
    "quote": "The Kingdom of heaven is like a net thrown into the sea. (Matthew 13:47)",
    "reading": "Jesus compares the Kingdom to a net gathering all for final judgment.",
    "psalm": "Psalm 84 longs for the courts of the Lord, declaring that one day in God’s presence is better than a thousand elsewhere.",
    "gospel": "Jesus describes the Kingdom as a net gathering all kinds, with the final sorting to come at judgment.",
    "prayer": "Lord, may we live every day ready for Your Kingdom. Let us be gathered among the righteous by lives of mercy and justice. Amen."
  },
  {
    "date": "2025-07-31",
    "quote": "Whatever you do, do everything for the glory of God. (1 Corinthians 10:31)",
    "reading": "Jesus teaches that scribes of the Kingdom share both old and new treasures.",
    "psalm": "Psalm 34 continues with praise for God's deliverance and invitation to taste and see His goodness.",
    "gospel": "Jesus speaks of the scribe trained for the Kingdom who brings forth both old and new treasures of faith.",
    "prayer": "Jesus, train us to be scribes of Your Kingdom. Help us to treasure Your Word and share it with wisdom and love. Amen."
  }
]