{"date":"2025-09-30","quote":"Many peoples and strong nations shall come to seek the Lord.","quoteCitation":"Luke 9:51-56","firstReading":"Zechariah promises a future in which peoples from many cities will come to seek the Lord, join themselves to Israel’s God, and live under his blessing. Even those from distant lands will take hold of a Jew’s robe, saying, “Let us go with you; for we have heard that God is with you.” The passage speaks hope, inclusion, and God’s drawing of nations toward covenant life and praise.","secondReading":"","psalmSummary":"Psalm 87 celebrates Zion as the Lord’s chosen foundation, the place from which peoples find their identity in God. The city is depicted as the source of birth and belonging, where even nations are counted among God’s own. The psalm highlights God’s delight in the place where his name dwells and points toward a universal belonging in the one city founded on the Lord.","gospelSummary":"In Luke 9:51–56 Jesus sets his face resolutely toward Jerusalem, fixing himself on the way of suffering and obedience. As he approaches a Samaritan village that will not receive him, James and John ask to call down fire on the village. Jesus rebukes them and moves on to another village. The scene contrasts Jesus’ resolute mission to bring redemption with the disciples’ impulse toward retaliatory judgment, revealing their misunderstanding and Jesus’ rejection of violent retribution.","saintReflection":"Saint Jerome (Memorial): Doctor of the Church Jerome translated Scripture into the Latin Vulgate, combining ascetic rigor with scholarly zeal, teaching that love of God is deepened through prayerful study of the Word.","dailyPrayer":"Lord Jesus, you set your face toward Jerusalem in obedience to your Father’s saving plan. Give us the same resolve to follow you even when the way is difficult. Teach us to resist the temptation to answer rejection with anger and to respond instead with patient witness and mercy. Through the example of Saint Jerome, inspire in us a hunger for your Word and a desire to make it accessible to others, that many peoples may be drawn to you. Form our hearts by Scripture so we may know and love you more deeply (CCC 136). Send your Spirit to guide our speech and actions, that we may be instruments of reconciliation and welcome. We ask this in your name, who lives and reigns with the Father and the Spirit, one God, for ever and ever. Amen.","theologicalSynthesis":"Today’s readings present a striking pair: Zechariah’s prophecy of nations seeking the Lord, and Luke’s account of Jesus’ determined journey to Jerusalem amid rejection. The prophet’s vision anticipates a broadening of God’s covenant—peoples taking hold to be led to the God who is with his people—while the Gospel shows the path by which that promise is fulfilled: Jesus’ costly obedience and merciful witness. Jerome’s life ties these themes together: by translating Scripture he helped bring God’s Word to varied peoples, enabling them to encounter the Lord. Scripture is not an abstract text but the living means by which God draws the nations (CCC 136). The Church, sent into the world, carries this mission: to form consciences, proclaim salvation, and invite all into communion with Christ (CCC 820).","exegesis":"Context: Zechariah 8:20–23 comes in a prophetic book that moves from judgment to hopeful restoration. After exile and return, the vision widens: the covenant is not a closed possession but a magnet for many peoples. The image of foreigners grasping a Jew’s cloak and saying, “We have heard that God is with you,” suggests both admiration and a desire to be led into God’s life. The prophecy reframes Israel’s identity as a source through which God’s blessing flows outward rather than an exclusive end.\n\nPsalm: The tiny psalm for the day centers on Zion—“his foundation is on the holy mountain”—and celebrates the city where God’s name dwells. In light of Zechariah, the psalm’s confidence becomes missionary: Zion’s foundation is also the basis for drawing nations. The psalmic language affirms corporate identity rooted in God’s presence; God’s dwelling confers a certain birthright, yet that birthright becomes the means of inviting others into common praise and belonging.\n\nGospel: Luke 9:51–56 places Jesus on a resolute trajectory to Jerusalem. His determination is theological: he goes to fulfill the Father’s plan. The Samaritans’ refusal to receive him exposes enduring ethnic and religious divisions. The disciples’ fiery reaction reveals their expectations of power and judgement—an impulse Jesus rejects. His rebuke points to a different mode of mission: not coercion or spectacle, but patient journeying toward the cross, where true reconciliation is won. The scene critiques any attempt to use divine name or power to justify violence.\n\nSaints: Jerome’s memorial invites reflection on how the Word of God is transmitted. Jerome combined austerity, linguistic skill, and prayer so that Scripture could be read and loved across cultural boundaries. His Vulgate became a vehicle for the very dynamic Zechariah envisions: peoples approaching because God’s presence is known in a people’s life and text. Jerome reminds us that evangelization often requires patient scholarly labor—translation, catechesis, liturgy—so that the faithful can know and live the Gospel (see the Church’s mission in her sacramental and teaching role, CCC 820).\n\nToday: The paired readings challenge Christians now: how do we become a people whose rooted life attracts others to God? First, by deepening our fidelity to Scripture and prayer so God’s presence is evident in our lives (CCC 136). Second, by rejecting the temptation to answer hurt or rejection with retaliation; the Gospel calls us to bear witness through mercy. Finally, like Jerome, we must attend to the practical work of making the Word accessible—through language, service, and testimony—so that many may indeed come seeking the Lord and find him in the community of his Church.","tags":["scripture","st-jerome","translation","mission","mercy","nonviolence","zechariah","luke","psalm","prayer"],"usccbLink":"https://bible.usccb.org/bible/readings/093025.cfm","cycle":"Year C","weekdayCycle":"Cycle I","feast":"Memorial of Saint Jerome, Priest and Doctor of the Church | USCCB","firstReadingRef":"Zechariah 8:20-23","secondReadingRef":"","psalmRef":"Psalm 87:1","gospelRef":"Luke 9:51-56","lectionaryKey":"Zechariah8:20-23|Psalm87:1|Luke9:51-56|Year C|Cycle I"}
