[{"date":"2025-12-27","quote":"That which was from the beginning, which we have heard.","quoteCitation":"1 John 1:1 (USCCB)","firstReading":"John opens by insisting that the Gospel is not myth but apostolic witness: the Word was from the beginning, was seen, heard, and touched. The author testifies to an embodied revelation of the eternal life manifested in Jesus. This testimony is shared so that readers may have fellowship with the Father and the Son, and that the apostles’ joy may be complete in those who receive this testimony.","secondReading":"","psalmSummary":"Psalm 97 proclaims the LORD’s kingship and holiness: the earth rejoices and storms bow before God’s rule. The psalm celebrates the presence of justice and vindication, calling clouds and lightning to witness the Lord’s dominance over idols. Radiant light and gladness belong to the faithful; darkness yields and the righteous rejoice. The concluding verses urge gladness and security for the upright, because God reigns with saving righteousness.","gospelSummary":"At dawn Mary Magdalene arrives at the tomb and finds the stone removed. Alarmed, she runs to Simon Peter and the beloved disciple to report that the body has been taken. Peter and the other disciple sprint to the tomb; the beloved disciple arrives first but waits, then enters and sees the linen wrappings and the cloth that had covered Jesus’ head rolled up. These signs lead them to believe—an encounter with absence that becomes a credible, sensory-based testimony to the Resurrection.","saintReflection":"Saint John (Apostle and Evangelist - Feast (Third Day in Octave of Christmas)): Saint John the Apostle and Evangelist (c. 5-101 AD) was the youngest of the Twelve Apostles, son of Zebedee and brother of James. Called by Jesus while mending his nets with his brother, John became known as 'the Beloved Disciple,' famous for leaning upon Jesus' breast at the Last Supper. At the foot of the Cross, the dying Jesus entrusted His mother Mary to John's care. John was present at the Resurrection's discovery and the miraculous catch of fish afterward. In his extreme old age, John continued visiting the churches of Asia Minor, repeating only: 'My dear children, love one another.' John is the author of the Fourth Gospel, three Epistles of John, and the Book of Revelation. His Gospel emphasizes the divinity of Christ and the fraternal love to which God calls His children. According to tradition, under Emperor Domitian, John was plunged into a caldron of boiling oil but miraculously emerged unharmed, after which he was exiled to the island of Patmos, where he received the mystical visions recorded in the Apocalypse. He is the only Apostle who died of natural causes rather than martyrdom, living to approximately 101 years of age. John is the patron saint of authors, loyalty, and friendship.","dailyPrayer":"Father of light and life, you who were revealed from the beginning in Jesus your Son, grant us the grace to receive and proclaim the apostolic witness. Kindle in our hearts the clarity of the beloved disciple: that seeing and touching the risen Lord transforms doubt into faith and fear into joy. Strengthen our fellowship so that your life may be shared in truth and love. By the example of Saint John, help us to remain close to Jesus at the Cross and at the empty tomb, faithful in witness and tender in charity. Send your Spirit to make our testimony credible, our joy secure, and our love contagious, until all come to know your saving life. Through Christ our Lord. Amen.","theologicalSynthesis":"These readings center on testimony, presence, and the light of revelation. 1 John asserts that the Christian claim is rooted in apostolic, sensory testimony to the incarnate Word and the life he imparts. Psalm 97 frames God’s reign as luminous justice that brings joy to the faithful. The Gospel narrates the physical signs of the empty tomb—linen strips and the head-cloth—elements that convert absence into credible witness. Together they invite a theology of embodied revelation: God disclosed in history, known through eyes that see, hands that touch, and communities that keep and share testimony. The figure of John, the eyewitness and author, unites these strands—faith formed by friendship with Christ and expressed in loving fellowship. Practically, the texts call the Church to confess the risen Lord with clarity, to live under God’s righteous rule, and to let apostolic joy complete our communal witness.","exegesis":"Context: The First Epistle of John opens with an emphatic claim about the origins and credibility of Christian proclamation. Writing in a community struggling with false teachings and spiritual ambiguity, the author insists that the message about the Word’s incarnation is not speculative but grounded in eyewitness contact: what 'was from the beginning' has been seen, heard, and touched. This counters docetic tendencies that denied Jesus’ true humanity and reassures believers that the life revealed in Christ is tangible and shareable. The Gospel reading from John complements this approach: the resurrection is first known through physical signs and the testimony of those who encountered the empty tomb.\n\nPsalm: Psalm 97 functions as a poetic proclamation of divine kingship. Its imagery of light, storms, and the discomfiture of idols serves to reorient worship toward the living God whose justice and presence bring joy. The psalmist’s insistence that light and gladness belong to the faithful resonates with Johannine motifs: light as revelation, joy as the result of right relation with God, and righteousness as the hallmark of God’s reign. In the season of Christmas and its octave, the psalm’s brightness frames the incarnation and resurrection as occasions for cosmic rejoicing.\n\nGospel: John 20:1a and 2-8 narrate the initial discovery of the empty tomb through the testimony of Mary Magdalene and the investigative rush of Peter and the beloved disciple. The beloved disciple’s arrival, entrance, and seeing of the burial bands and head-cloth are narrated with careful, sensory detail. The emphasis on who arrived first but allowed Peter to enter underscores both ordered apostolic authority and the priority of testimony. The folded cloth becomes a silent sign, prompting belief that is not direct vision of the risen Christ but trust formed by signs and the interpretive witness of the community.\n\nSaints: Saint John stands at the crossroads of these texts. As the 'Beloved Disciple,' he is the paradigmatic eyewitness whose testimony shaped the Gospel and the epistles. Tradition that places him at the Cross and at the empty tomb underscores his intimacy with Jesus and his capacity to transmit that intimacy as authoritative testimony. John’s theological emphasis—on the Word made flesh, on love as the Christian ethic, and on the reality of the resurrection—makes him an exemplary interpreter of both the apostolic claim and the psalmist’s praise. His long life of ministry models continuity: apostolic witness entrusted across generations to form the Church’s memory.\n\nChristology: The combined witness of 1 John and the Johannine Gospel advances a high Christology anchored in incarnation and resurrection. The Word 'from the beginning' signals preexistence and participation in divine life; the insistence on having 'seen' and 'touched' the life incarnate counters any spiritualizing that would detach Jesus from real human flesh. The empty tomb narrative complements this by offering material signs that point beyond absence to life. Together they argue that Christ’s divinity and humanity are integrally known through historical events and community remembrance, not merely metaphysical speculation.\n\nCommunity: Central to these passages is the communal reception and transmission of testimony. 1 John frames the apostolic report as a means to fellowship with the Father and the Son and the completion of apostolic joy. The Gospel shows Mary and the disciples acting together—reporting, running, entering, discerning—so that faith is a corporate act mediated by mutual witness. Psalm 97’s call to rejoicing and light likewise presumes a people who respond together. The ecclesial implication is clear: the Church is the custodian of memory, the interpreting body that reads signs, rehearses testimony, and passes on belief in the risen Lord.\n\nToday: These readings ask contemporary Christians to attend to the credibility and character of their witness. In an age of skepticism, the apostolic model invites careful, embodied testimony—lived fidelity, not mere assertion. The signs we show must be convincing: lives transformed by communion with Christ, sacramental participation that echoes the tactile reality emphasized by John, and mutual love that evidences the truth we proclaim. Practically, this means cultivating communities where testimony is told, examined, and lived; where joy and righteousness mark public witness; and where the memory of the apostles shapes preaching, catechesis, and daily discipleship. The beloved disciple’s example reassures the Church that faithful, persistent witness—grounded in encounter with Jesus—will bear fruit even amid doubt and opposition.","tags":["saint-john","witness","light","resurrection","apostolic-testimony","st.-john","fellowship"],"usccbLink":"https://bible.usccb.org/bible/readings/122725.cfm","cycle":"Year B","weekdayCycle":"Cycle I","feast":"Apostle and Evangelist - Feast (Third Day in Octave of Christmas)","firstReadingRef":"1 John 1:1-4","secondReadingRef":"","psalmRef":"Psalm 97:1-2, 5-6, 11-12","gospelRef":"John 20:1a and 2-8","lectionaryKey":"2025-12-27:1 John 1:1-4||Psalm 97:1-2, 5-6, 11-12|John 20:1a and 2-8"}]
