[{"date":"2025-09-21","quote":"No servant can serve two masters; you cannot serve both God and money.","quoteCitation":"Luke 16:1-13","firstReading":"Amos condemns those who exploit the poor: merchants who cheat with dishonest scales, those who crush the needy and call the day of the Lord distant. The prophet warns that God will not overlook exploitation and empty religiosity. Justice cannot be delayed, and God judges societies that prosper by trampling the vulnerable. Amos calls for integrity in business and compassion for the oppressed.","secondReading":"","psalmSummary":"Psalm 113 praises a God who is exalted above all yet attentive to the lowly. The same Lord who dwells on high looks down to lift the poor from the dust and seat them among princes. The psalm connects God’s majestic transcendence with intimate care for the marginalized, offering hope that divine justice reverses human injustice.","gospelSummary":"In Luke 16 Jesus tells the parable of the dishonest steward who, facing dismissal, shrewdly secures his future by arranging debts in favor of his master’s debtors. Jesus praises the steward’s prudence while turning the lesson toward discipleship: use worldly wealth to make friends who welcome you into eternal homes. He insists on faithful stewardship—being trustworthy in small matters precedes trust in greater things—and delivers the stark principle: you cannot serve both God and money. The parable calls Christians to intelligent, generous use of possessions and total fidelity to God.","saintReflection":"Saint Matthew, Apostle and Evangelist (Feast): Saint Matthew, one of the Twelve Apostles, was a former tax collector called by Jesus. He authored the Gospel of Matthew, presenting Christ as the fulfillment of Old Testament prophecy. His feast celebrates his evangelistic zeal and the enduring impact of his Gospel. Canonized by early Christian tradition for his pivotal role in spreading the Gospel.","dailyPrayer":"Lord Jesus, you called Matthew from the tax booth into apostolic service and taught us to choose you over wealth. Give us eyes to see the poor, hearts willing to share, and the prudence to use material goods for friendship with others and for your Kingdom. Heal our complicity in systems that exploit (CCC 1420–1498); lead us back to right relations through repentance and the sacraments. Guide our reading of Scripture so its truth forms our conscience and actions (CCC 136–141). May our lives reflect faithful stewardship, generous giving, and joyful witness like Saint Matthew. Amen.","theologicalSynthesis":"Today’s readings form a moral and pastoral unity: Amos confronts structural injustice, the psalm sings of God’s preferential care for the lowly, and Luke summons disciples to faithful stewardship of wealth. The moral demand is not mere asceticism but responsible use of goods for others and for the Kingdom. Scripture forms and judges our conscience (CCC 136–141), while Christian conversion and reconciliation, lived and renewed in the sacraments, reorient our attachments (CCC 1420–1498). Saint Matthew’s call from tax collector to evangelist models how conversion transforms relationships to money into service for God and neighbor.","exegesis":"Context: Amos speaks in the eighth century BCE to Israel and Judah amid relative prosperity. The prophet’s jeremiad targets normalized injustice—market manipulation, legal wrongdoing, and religious hypocrisy. His fierce denunciation is rooted in covenant faith: prosperity that relies on oppression is prophetic danger. The passage pushes the community to examine economic practices, not only cultic observance, because covenant fidelity demands justice.\n\nPsalm: Psalm 113 provides the theological counterpoint: God reigns in high heaven yet acts decisively for the lowly. The psalmist lifts the divine project of reversal—those humiliated by society are raised and honored. This divine behavior frames the prophet’s outrage and the Gospel’s call: God’s reign upends human hierarchies that marginalize the poor.\n\nGospel: Luke’s parable of the dishonest steward is famously difficult. Jesus does not commend corruption but rather the steward’s foresight in securing relationships for the future. Luke reframes prudence: resources are to be employed for hospitality and mutual aid—“making friends” who welcome you into eternal dwellings. The parable culminates in ethical imperatives: faithfulness in small things, clarity about ultimate loyalties, and the incompatibility of serving God and mammon. The story transforms money from an end into a test of allegiance and means of grace when used charitably.\n\nSaints: Celebrating Saint Matthew on this feast sharpens the day’s themes. As a former tax collector, Matthew embodies the moral tension between economic role and divine call. His conversion and subsequent evangelistic labor show that personal history with money can become the soil of holiness. Matthew’s Gospel also portrays Jesus as fulfillment of God’s promise, connecting prophetic justice and the Gospel’s call to conversion and right living.\n\nToday: The readings confront contemporary realities—inequitable markets, consumerism, and the tendency to idolize wealth. The Christian response is twofold: structural and personal. Structurally, communities must resist and reform systems that profit from the poor; personally, disciples are called to faithful stewardship, generous hospitality, and conversion of heart. Scripture grounds conscience and mission (CCC 136–141), and the sacraments sustain ongoing repentance and reorientation of desire (CCC 1420–1498). Practically, this means fair business practices, charitable giving, advocacy for the vulnerable, and formation that trains Christians to use goods for friendship with God and neighbor.","tags":["stewardship","social-justice","amostheprophet","luke-16","saint-matthew","conversion","wealth","almsgiving","scripture","feast-day","prayer"],"usccbLink":"https://bible.usccb.org/bible/readings/092125.cfm","cycle":"Year C","weekdayCycle":"Cycle I","feast":"Feast","firstReadingRef":"Amos 8:4-7","secondReadingRef":"1 Timothy 2:1-8","psalmRef":"Psalm 113:1-2, 4-6, 7-8","gospelRef":"Luke 16:1-13","lectionaryKey":"Amos8:4-7|Psalm113:1-2,4-6,7-8|Luke16:1-13|Year C|Cycle I"}]
