[{"date":"2025-09-24","quote":"Proclaim the kingdom of God and heal the sick.","quoteCitation":"Luke 9:1-6","firstReading":"Ezra stands before the people in humble confession, naming Israel’s infidelity and mixed marriages as a breaking of covenant. He acknowledges the community’s guilt yet exalts God’s mercy: the Lord has not abandoned them despite their sins. Ezra’s prayer is both penitential and trustful, asking God to act for the sake of his great kindness and to restore the people to faithful life.","secondReading":"","psalmSummary":"The Tobit psalm sings praise for God’s justice and kindness, celebrating how the Lord lifts up the faithful and blesses those who keep covenant. It calls for rejoicing in God’s saving works and reminds the community that God’s governance brings order, mercy, and the flourishing of the righteous.","gospelSummary":"In Luke 9:1–6 Jesus sends the Twelve on mission, giving them authority over unclean spirits and the power to heal. He commissions them to proclaim the kingdom, to rely on the hospitality of those who welcome them, and to travel light—taking nothing for the journey. Their work models urgency and dependence on God’s providence: they preach repentance, heal the sick, and demonstrate the nearness of God’s reign by word and deed.","saintReflection":"Blessed Anton Martin Slomsek: Anton Martin Slomšek was born in 1800 inToday’s Slovenia. As a bishop, he championed education, founded schools, and authored catechetical texts in the Slovene language to strengthen national identity. His pastoral letters inspired devotion to the Eucharist and Marian spirituality. Beatified in 1999, he is venerated for fostering faith and culture among the Slovene people.","dailyPrayer":"Lord Jesus, you sent your disciples out with authority to heal and to proclaim your kingdom. Give us generosity of heart to confess our failures like Ezra and to seek your mercy. Help us, like those who praise you in Tobit, to rejoice in your just and loving care. Send workers who teach and form faith—teachers, catechists, and pastors—who will nurture belief and devotion in our homes and schools. May Blessed Anton Martin Slomšek intercede for those who foster Christian education and Eucharistic life in every nation. Teach us to depend on your providence, to welcome the stranger, and to serve with humility. We ask this in the name of the One who heals and saves. (CCC 136; CCC 1420)","theologicalSynthesis":"Today’s readings bind repentance, mission, and formation. Ezra’s public confession reminds us that turning back to God is the first step in communal renewal; conversion is not merely private but reshapes the people. Jesus’ sending of the Twelve reveals that ministry is both proclamation and concrete service—healing, speaking of the kingdom, and living in dependence on God and neighbor. This mission continues in the Church through catechesis and institutions that form consciences and skills for discipleship, a work exemplified by Blessed Anton Slomšek. Scripture guides this life of faith (CCC 136), and the Incarnation grounds mission in God’s self-giving presence, which sends us to others in humility and love (CCC 456).","exegesis":"Context: Ezra’s short prayer in chapter 9 follows the shocking discovery of mixed marriages that threaten Israel’s fidelity to the covenant. The exile has not erased God’s mercy, yet the people must name their infidelity before they can be purified. Ezra models corporate repentance: a leader publicly owning communal sin and appealing to God’s loving-kindness. This moment recalls the prophetic pattern that links contrition with restoration, asking the Lord to act not because we deserve it but because of his steadfast kindness (CCC 136).\n\nPsalm: The verses from Tobit are a hymn of praise that frames suffering and deliverance in covenant terms. Where Ezra confesses sin, Tobit’s words praise God who exalts the humble and establishes justice. Together they teach a balance: penitence before God’s mercy and praise after experiencing divine action. The psalm encourages trust that God’s governance brings blessing when his people cling to righteousness.\n\nGospel: Luke’s commissioning narrative is practical and radical. Jesus empowers the Twelve to drive out demons and heal, then sends them out with minimal baggage, instructing dependence on hospitality and the immediate proclamation of repentance. The mission is not a long-term, institution-building project but an urgent testimony to God’s nearness. The instruction to take nothing for the road underscores reliance on God and the Christian duty to accept and be sustained by community hospitality. Healing and preaching go hand in hand—sign and word together announce the inbreaking kingdom.\n\nSaints: Blessed Anton Martin Slomšek’s life brings these themes into concrete pastoral practice. As bishop he invested in schools and catechetical texts to form a Christian people able to receive and transmit the Gospel. His devotion to the Eucharist and Mary nurtured sacramental and devotional life that sustained local faith communities. Slomšek shows how mission requires institutions of formation: sending well-prepared disciples into places that will welcome and be changed by them.\n\nToday: The combined message calls the Church to confess, to teach, and to send. We are invited to examine communal and personal failings honestly, seek God’s mercy, and then be ready to proclaim and serve—often with limited resources but sustained by hospitality and prayer. Pastoral ministry must marry proclamation with formation so evangelization endures. In practical terms, this means supporting catechesis, welcoming missionaries, caring for the sick, and modeling dependence on God rather than on human agendas. Conversion transforms communities and creates the conditions for effective mission and true praise (CCC 1420).","tags":["repentance","mission","evangelization","hospitality","healing","catechesis","blessed-anton-slomsek","scripture","eucharist","luke","ezra","tobit"],"usccbLink":"https://bible.usccb.org/bible/readings/092425.cfm","cycle":"Year C","weekdayCycle":"Cycle I","feast":"","firstReadingRef":"Ezra 9:5-9","secondReadingRef":"","psalmRef":"Tobit 13:2, 3-4","gospelRef":"Luke 9:1-6","lectionaryKey":"Ezra9:5-9|Tobit13:2,3-4|Luke9:1-6|Year C|Cycle I"}]
