[
  {
    "date": "2025-08-19",
    "quote": "For God all things are possible.",
    "quoteCitation": "Mt 19:26",
    "firstReading": "An angel greets Gideon, calling him to save Israel from the Midianites. Gideon, doubting his strength and importance, is reassured by God’s promise: 'I shall be with you.' Called from obscurity, Gideon builds an altar of peace, signifying the reward waiting on the other side of obedience. The story turns focus from human capacity to divine sufficiency.",
    "psalmSummary": "Psalm 85 is a song of fresh hope after suffering. The people long for peace and salvation, awaiting God’s mercy. Righteousness and truth spring up, and the land is transformed by the Lord’s faithfulness.",
    "gospelSummary": "Jesus contrasts worldly riches with the poverty of spirit needed for entrance to God’s reign. He reassures the disciples that those who sacrifice possessions or family for his sake will receive unimaginable blessings—and that with God, the impossible becomes possible. The last will be first, and the first last.",
    "saintReflection": "Saint John Eudes, celebrated today, founded communities devoted to education and care of the poor and priests. His trust in God’s providence was unwavering even when beginnings seemed impossible. Eudes exemplifies the truth that surrender of our plans allows God to accomplish greater things.",
    "dailyPrayer": "God of wonders, help us abandon what holds us back, confident that your grace sustains all who answer your call. When we doubt our strength, remind us you are with us. May your peace be the altar on which our choices rest.",
    "theologicalSynthesis": "Obedience is never about strength but about trust. God’s kingdom inverts expectations: in our littleness, we become vessels for a greater glory—the impossible made possible.",
    "exegesis": "The tale of Gideon begins in hesitation and questioning—a messenger finds him hiding, yet calls him 'valiant warrior.' The real drama is not Gideon's prowess but his eventual yes to God’s initiative. The text highlights how true leadership in Scripture is always reluctant, always reliant on grace, never on pride.\\nThe Psalm waits on a new beginning: the weariness of exile gives way to a dream of restoration. The promised peace is not utopian but rooted in God's past fidelity and protection.\\nJesus’ dialogue with his disciples reorients their imagination—no human accomplishment can merit the kingdom, and even so, God gives it as pure gift. The promise of multiplied blessing for those who leave all for Christ is a challenge and an assurance.\\nSaint John Eudes’ lifework was a testimony to unanticipated fruitfulness. Human plans gave way to divine initiative, and his legacy shaped generations. All our vocations are invitations to move from impulsive plans to surrendered, fruitful faith.",
    "secondReading": null,
    "tags": [
      "Impossible",
      "Trust",
      "Faith",
      "Saint John Eudes",
      "Reward"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/081925.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle I",
    "feast": "Feria",
    "gospelReference": "Matthew 19:23–30",
    "firstReadingRef": "Judges 6:11–24a",
    "secondReadingRef": null,
    "psalmRef": "Psalm 85:9, 11–12, 13–14",
    "gospelRef": "Matthew 19:23–30",
    "lectionaryKey": "Judges6:11–24a|Psalm85:9,11–12,13–14|Matthew19:23–30|Year B|Cycle I"
  }
]
