[{"date":"2026-01-18","quote":"Behold the Lamb of God who takes away the sin","quoteCitation":"John 1:29-34","firstReading":"Isaiah 49:3, 5-6 presents the Servant as one formed and honored by God and charged with a universal mission. The Servant’s vocation is both to restore Israel and to be a light to the nations; his calling is meant to gather the scattered, bring Jacob back, and make God’s salvation known to the ends of the earth. The passage widens the servant’s role beyond national restoration to an inclusive, missionary purpose.","secondReading":"Paul opens 1 Corinthians 1:1-3 with his apostolic greeting to the Corinthian community, naming Sosthenes and invoking God’s grace. He blesses them with grace and peace from God the Father and the Lord Jesus Christ. The brief salutation underscores apostolic authority, the divine origin of Paul’s ministry, and the spiritual gifts that mark the life and identity of the church as a community sustained by grace.","psalmSummary":"Psalm 40:2, 4, 7-8, 8-9, 10 recounts God’s timely deliverance and the psalmist’s response of trust and obedience. Having been lifted from a desperate place, the singer now proclaims a new song and invites others to trust in the Lord. Verses 7–10 stress interior submission—God’s will written on the heart—and a public commitment to speak and act God’s justice and faithfulness, bearing witness to God’s saving works.","gospelSummary":"In John 1:29-34 John the Baptist identifies Jesus as the Lamb of God, declaring that he takes away the sin of the world and signaling a sacrificial, redemptive role. John admits he did not previously know Jesus but was given a sign: the Spirit descending like a dove and remaining on him. That sign verifies Jesus as the Son of God and the one who will baptize with the Holy Spirit. The passage centers witness—John’s testimony—linking baptism, Spirit, and messianic identity and reinterpreting sacrificial imagery in light of Jesus’ vocation.","saintReflection":"Feria: This date is a Sunday or weekday of Ordinary Time (depending on the movable feasts) with no fixed universal saint’s memorial attached.[184][193] Many devotional calendars associate it with various saints, but these are usually optional commemorations.","dailyPrayer":"Lord God, you call your servants from before birth and send them as light to the nations. Grant us ears to hear your servants’ testimony, like John the Baptist, and hearts ready to recognize Christ when the Spirit reveals him. Make us instruments of your saving work: teach us to trust in your timing, to obey your will written within us, and to proclaim your faithfulness in word and deed. Strengthen your Church with grace and peace through Jesus Christ, who baptizes with the Holy Spirit. Help us live sacrificially for the life of the world until the fullness of your kingdom comes. Amen.","theologicalSynthesis":"The readings form a coherent theological arc: Isaiah’s Servant receives a universal commission, the psalmist responds with trust and public obedience, Paul greets a community shaped by apostolic grace, and John the Baptist’s witness identifies Jesus as the Lamb who inaugurates salvation by the Spirit. Together they present vocation (God’s call), mission (to gather and enlighten), and the means (grace, Spirit, and sacrificial love). The continuity between God’s covenantal sending in Isaiah and the Johannine revelation reframes Israel’s hopes around Jesus’ person and work, while the Church receives that mission in baptism and witness.","exegesis":"Context: The readings for this day gather threads from Israel’s prophetic tradition, the psalmic response of trust, apostolic commissioning, and the Johannine witness. Isaiah 49:3, 5-6 speaks from the mouth of the Servant songs that imagine one uniquely formed and appointed by God to restore Israel and to serve as light for the nations. Psalm 40 covers the experience of rescue and the ethical-musical response of proclamation. Paul’s salutation in 1 Corinthians establishes apostolic authority and grace as the foundation of community. John 1:29-34 places a baptismal and christological interpretation on Jesus’ identity through the sign of the Spirit. Together these readings create a horizon of calling, vindication, and mission that spans covenant history into the church’s present vocation.\n\nFirst Reading: In Isaiah 49:3, 5-6 the Servant is not first named only as Israel’s hope but as one with an expanded purpose. The servant’s mission is paradoxical: intimate formation (from the womb) and public, wide-ranging responsibility (to the ends of the earth). The text reframes chosen-ness as commission: being honored by God entails being sent. The servant’s restoration of Jacob and the enlargement of mission to the nations imply that Israel’s salvation is meant to be a conduit for universal blessing. This prophetic move anticipates later Christian readings that see in the Servant a foreshadowing of Christ’s mission and of the Church’s global vocation.\n\nPsalm: Psalm 40 balances personal testimony and communal summons. The psalmist’s memory of deliverance—pulled out of a pit and given a new song—becomes the basis for ethical commitment and proclamation. Verses 7–10 emphasize interior availability to do God’s will and an outward witness to God’s faithfulness. In the liturgical setting the psalm instructs the community to respond to divine rescue not merely with gratitude but with obedient speech and action. The link between private deliverance and public testimony echoes John the Baptist’s example: one who has seen God’s act must then bear witness so others can trust.\n\nGospel: John 1:29-34 presents a brief but theologically dense scene. John the Baptist’s declaration, calling Jesus the Lamb of God, reframes sacrificial language in light of the one who will enact God’s decisive saving act. The Spirit’s descent like a dove and remaining on Jesus functions as the defining sign for Johannine testimony. John stresses that his recognition of Jesus comes via revelation, not prior personal knowledge. The passage tightly links baptism, the Spirit, and messianic identity, signaling that Jesus’ ministry inaugurates the Spirit’s fuller outpouring and that John’s role is prophetic witness—pointing others to the Messiah.\n\nSaints: The designation Feria on this date highlights how the Church’s calendar preserves ordinary time for the sanctification of daily life. When no obligatory memorial is attached, the readings stand central and invite local devotion. The lack of a fixed universal saint’s feast can itself be a theological reminder: holiness is not confined to named figures but is lived in the ordinary obedience of those called by God to speak and serve. John the Baptist, though not commemorated here as a titular saint of the day, models the prophetic vocation to point beyond oneself to Christ.\n\nToday: The combined message speaks directly to the Church’s identity. We are people called by God, shaped by grace and the Spirit, and sent to make God known. Isaiah’s expansive commission challenges narrow conceptions of mission; the psalm insists on trustworthy testimony; Paul’s greeting roots community in apostolic grace; John’s witness locates the decisive revelation in Christ accompanied by the Spirit. Pastoral application asks Christians to attend to recognition—how we discern Christ in our midst— to the centrality of Spirit-baptism for mission, and to a life of obedient speech and service that echoes the Servant’s vow to bring salvation to all peoples.","tags":["feria","lamb-of-god","mission","servant","baptism","spirit","witness","ordinary-time"],"usccbLink":"https://bible.usccb.org/bible/readings/011826.cfm","cycle":"Year B","weekdayCycle":"Cycle II","feast":"","firstReadingRef":"Isaiah 49:3, 5-6","secondReadingRef":"1 Corinthians 1:1-3","psalmRef":"Psalm 40:2, 4, 7-8, 8-9, 10","gospelRef":"John 1:29-34","lectionaryKey":"2026-01-18:Isaiah 49:3, 5-6|1 Corinthians 1:1-3|Psalm 40:2, 4, 7-8, 8-9, 10|John 1:29-34"}]
