[{"date":"2026-01-14","quote":"Here am I, Lord; I come to do your will.","quoteCitation":"Psalm 40:2 and 5, 7-8a, 8b-9, 10 (USCCB)","firstReading":"In 1 Samuel 3, young Samuel, serving under Eli, encounters the Lord’s call at a time when prophetic speech was uncommon. Repeatedly summoned by name, Samuel follows Eli’s direction and responds to God, receiving a difficult oracle concerning judgment on Eli’s household. Samuel accepts his vocation and, from that point forward, the Lord continues to reveal himself through Samuel, who is recognized throughout Israel as a true prophet.","secondReading":"","psalmSummary":"Psalm 40 gives thanks for God’s rescue and recounts patient waiting for the Lord. The psalmist praises deliverance from distress, notes how many marvel at God’s work, and contrasts ritual sacrifice with responsive obedience. Rather than merely burned offerings, the psalm insists God desires an ear opened to listen; the speaker commits to proclaiming God’s faithfulness and justice before the assemble of the faithful.","gospelSummary":"In Mark 1:29-39 Jesus heals Simon Peter’s mother-in-law, who is restored and immediately serves them. That evening many who were sick or possessed are brought to him and he cures them and drives out demons, refusing to allow the demons to speak because they know him. At dawn Jesus withdraws to pray alone; when the disciples find him, he declares his mission to proclaim the good news elsewhere so he can preach in neighboring towns and continue his itinerary of healing and proclamation throughout Galilee.","saintReflection":"Feria: The General Roman Calendar lists this date as a feria, without a universal saint’s memorial.[189][193] Some national or diocesan calendars may inscribe local saints or blesseds with optional observance.","dailyPrayer":"Almighty and merciful God, you call your servants and shape your mission in quiet obedience. Grant that, like Samuel, we may recognize your voice amid confusion and answer with prompt and humble trust. Teach us, as the psalmist affirms, to prefer obedient service to mere ritual, to open our ears to your will, and then to proclaim your faithfulness. Strengthen us in prayer as Jesus withdrew to pray, that our words and works of compassion flow from communion with you. Heal what is broken within and among us, and send us in the power of your Spirit to serve those in need. Through Christ our Lord. Amen.","theologicalSynthesis":"The readings form a tight theological circle: God calls, the faithful listen, and the result is healing and proclamation. Samuel’s vocation begins in attentive listening and yields authoritative prophetic speech. The psalm reframes worship as ear-opening obedience rather than mere sacrifice. In Mark, Jesus’ healing ministry issues from prayer and then gives rise to mission; his withdrawal to pray models the source of effective service. Together they teach that authentic ministry arises from hearing God’s word, responding in faithful obedience, and bringing God’s healing presence to others.","exegesis":"Context: The first reading presents the origin of Samuel’s prophetic office amid a religious landscape where direct revelation had grown rare. The narrative emphasizes stages: confusion, instruction from a mentor (Eli), a proper response to the divine call, and the transmission of a difficult message about judgment. The episode marks Samuel’s transition from a temple servant to a recognized prophetic mouthpiece; it also reveals how God can restore authoritative speech to Israel through a receptive heart. The passage sits within the broader Deuteronomistic concern for covenant fidelity and the consequences of priestly failure.\n\nPsalm: Psalm 40 interweaves thanksgiving with vocation. The psalmist narrates a rescue from peril and then reframes the proper response to God's action: not ritual repetition but obedient availability. The striking image of an opened ear foregrounds willingness to hear and obey; thereafter follows a public commitment to proclaim God’s works and justice. This psalm both echoes and shapes prophetic identity—deliverance leads to service, and service is measured by fidelity rather than liturgical performance alone.\n\nGospel: Mark’s vignette of healing in Capernaum balances immediate compassion with deeper pattern. Jesus cures Peter’s mother-in-law and then heals many who come that evening; despite spectacular success he silences demons and withdraws to pray. This rhythm—ministry fed by solitude—prepares the mission that follows. Jesus’ insistence on moving to other towns shows that the purpose of signs is not adulation but the spread of the kingdom through proclamation and healing. Mark links authority over sickness and spirits with the authoritative word that he will preach.\n\nSaints: The day’s designation as a feria without a universal memorial points readers away from an exemplary individual and toward the ordinary call shared by all believers. The readings model how saints are made: attentive listening, obedient response, and sustained proclamation. Whether named on the calendar or not, the faithful are invited to this pattern. The absence of a particular patron thus becomes a theological prompt: holiness is not limited to extraordinary figures but is the fruit of fidelity in everyday calling.\n\nToday: The texts address contemporary pastoral priorities. Churches often possess activity without rootedness in prayer; Mark’s example counters that tendency. Likewise, many want visible sacrifices—programming, offerings—without cultivating interior availability. The psalm’s critique remains urgent: God prefers an ear opened to discernment rather than ritualism alone. Samuel’s formation under Eli suggests the lasting value of mentorship in spiritual discernment. The readings together argue for institutions and ministries shaped by listening, prayerful reflection, and then decisive action for healing and proclamation.\n\nConclusion: Bringing these threads together yields a pastoral blueprint: cultivate spaces of silence for discernment; form leaders who teach novices to hear God’s voice; prioritize obedient service over mere activity; and allow signs to fuel, not replace, preaching of the kingdom. The narrative and liturgical materials on this day invite communities to test their programs by whether they produce servants who listen, who are willing to carry difficult truth, and who, like Jesus, return to solitude to be strengthened for mission.","tags":["feria","daily-mass","ordinary-time","call","prayer","healing","prophecy","samuel","mark"],"usccbLink":"https://bible.usccb.org/bible/readings/011426.cfm","cycle":"Year B","weekdayCycle":"Cycle II","feast":"","firstReadingRef":"1 Samuel 3:1-10, 19-20","secondReadingRef":"","psalmRef":"Psalm 40:2 and 5, 7-8a, 8b-9, 10","gospelRef":"Mark 1:29-39","lectionaryKey":"2026-01-14:1 Samuel 3:1-10, 19-20||Psalm 40:2 and 5, 7-8a, 8b-9, 10|Mark 1:29-39"}]
