[
  {
    "date": "2026-01-16",
    "quote": "Rise; take up your mat, and go home now.",
    "quoteCitation": "Mark 2:11",
    "firstReading": "In 1 Samuel 8:4–7,10–22a the Israelites demand a king to be like the nations. Samuel is displeased and prays to the Lord, who tells him to heed the people though they have rejected divine kingship. Samuel warns the people that a human king will conscript sons, seize property, levy taxes, and make servants of their labor, but the people persist in asking for a king to lead them and judge them.",
    "secondReading": "",
    "psalmSummary": "Psalm 89:16–19 praises the people who live in the light of the Lord’s favor. The psalmist celebrates God as the source of strength and exaltation, noting that God’s kindness uplifts the people and makes their power flourish. God is portrayed as shield and king, the Holy One of Israel whose presence secures the nation’s well-being and inspires loyal worship and confidence among those who follow him.",
    "gospelSummary": "In Mark 2:1–12 Jesus is teaching in Capernaum when a paralytic is brought by friends but cannot reach Jesus because of the crowd. They remove part of the roof and lower the man to Jesus. Seeing their faith, Jesus first pronounces the man’s sins forgiven, which provokes scribes to accuse him of blasphemy. Jesus perceives their thoughts and demonstrates his authority by healing the paralytic, telling him to take up his mat and walk. The crowd is amazed and praises God, recognizing both forgiveness and healing as signs of divine authority present in Jesus.",
    "saintReflection": "Today is a feria; the universal calendar gives the weekday liturgy precedence. Local and traditional calendars may optionally commemorate Franciscan protomartyrs or other saints, but the readings remain focused on God’s rule and mercy. The optional memory of martyrs invites reflection on faithfulness: like the friends who carried the paralytic, saints bear witness by persevering and bringing others to Christ, even when barriers seem insurmountable.",
    "dailyPrayer": "Lord God, you are our king and our shield; hear our prayer. Grant us leaders who serve with wisdom rather than seeking dominion, and grant us communities of faithful friends who carry one another to you in need. Give us eyes to see your authority at work in mercy and forgiveness, and hearts to confess our need for your healing touch. Strengthen those who are sick, console those who are anxious, and inspire us to act with charity and courage. Through Christ our Lord. Amen.",
    "theologicalSynthesis": "The readings set up a contrast between human kingship and God’s rule, and between communal faith and private judgment. Samuel’s warning about monarchy shows the dangers of transferring ultimate authority from God to fallible leaders. Psalm 89 praises God as the true source of strength and exaltation for the people. In Mark, Jesus exercises divine authority by forgiving sins and healing, thereby revealing that God’s reign is realized in mercy. The community’s role—friends lowering a paralytic through a roof—models how faith is enacted: it brings the needy to Christ and participates in the kingdom. Thus the text challenges believers to seek God’s lordship manifested in compassion, not merely human power.",
    "exegesis": "Context: The first reading from 1 Samuel comes from a pivotal moment in Israel’s history. The people’s demand for a king “to be like the other nations” exposes a theological crisis: distrust in the covenantal model of divine rule. Samuel’s displeasure is less nostalgia than prophetic alarm—the transfer of ultimate authority to a human monarch risks turning God’s gifts into instruments of domination. The Lord’s response, to authorize the request but warn of its cost, both respects popular freedom and foreshadows the ambiguities of Israelite monarchy. The narrative sets a background for later reflections on legitimate authority and the dangers of power divorced from covenantal service.\n\nPsalm: Psalm 89:16–19 responds with a confident anthem of the Lord as source of strength and exaltation. The psalmist’s language—God as glory, strength, shield, and king—frames Israel’s well-being as derivative from divine favor rather than merely human institutions. The psalm resists the idea that victory or security belong primarily to military or political arrangements; instead it grounds communal flourishing in divine faithfulness. In the context of Samuel’s dialogue, the psalm invites the community to remember that legitimate leadership is one that reflects God’s character: protective, life-giving, and oriented toward covenantal fidelity.\n\nGospel: Mark 2:1–12 presents a concentrated episode revealing Jesus’ authority. The narrative structure highlights the crowd, the friends’ initiative, Jesus’ perception, and the result. The friends’ radical action—removing part of a roof—displays both desperation and communal solidarity. Jesus’ first word is forgiveness, which unsettles scribal sensibilities: to forgive sins is God’s prerogative. Mark shapes the encounter so that Jesus’ subsequent miracle (healing the paralytic) vindicates his claim to forgive, demonstrating that forgiving and restoring are signs of God’s reign breaking into history. The crowd’s amazement underscores the theological thrust: Jesus is not merely a wonder-worker but one in whom God’s authority is manifest.\n\nSaints: The feria of the day gives liturgical priority to the weekday readings rather than a specific obligatory saint, though local calendars may remember martyr figures such as the Franciscan protomartyrs. That optional remembrance can be read thematically into the readings: martyrs and faithful witnesses model the very solidarity that transports the paralytic to Jesus. They also embody prophetic resistance to unjust powers—paralleling Samuel’s critique of monarchic excess—by witnessing to God’s higher sovereignty. The saints thus exemplify the interplay of communal fidelity and prophetic critique present in the texts.\n\nTheological implications: Together these texts probe what legitimate authority looks like. Samuel warns that human rulers often replicate the forms of coercion and exploitation found in pagan polities. The psalm responds by locating authority in God’s sustaining love. Mark’s Gospel then concretely identifies Jesus as the locus of divine authority expressed in mercy: forgiving sin and restoring bodily wholeness. The narrative therefore reframes political and ecclesial authority’s aim: it must serve reconciliation and life. The friends’ faith and courage also teach ecclesiology—the church is a body that carries the vulnerable to Christ, dismantling barriers, whether roofs or structures of neglect.\n\nToday: Pastoral application is immediate. Communities should examine where they imitate the “king” Samuel warns about—prioritizing control, prestige, or self-protection over service. The Gospel calls Christians to remove obstacles for the needy, to prioritize forgiveness, and to trust that sacramental and communal care participate in God’s healing reign. Practically, this means forming leaders who serve, cultivating friendships that bring the suffering to Christ, and shaping liturgy and ministry around mercy. In a world of competing authorities, these readings summon the church to embody the noncoercive, reconciling rule of God, visible where forgiveness and compassionate action meet.",
    "tags": [
      "feria",
      "weekday",
      "feria",
      "kingship",
      "authority",
      "forgiveness",
      "healing",
      "community",
      "samuel",
      "mark",
      "psalm-89"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/011626.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "",
    "gospelReference": "Mark 2:1-12",
    "firstReadingRef": "1 Samuel 8:4-7, 10-22a",
    "secondReadingRef": "",
    "psalmRef": "Psalm 89:16-17, 18-19",
    "gospelRef": "Mark 2:1-12",
    "lectionaryKey": "2026-01-16:1 Samuel 8:4-7, 10-22a||Psalm 89:16-17, 18-19|Mark 2:1-12"
  },
  {
    "date": "2026-01-17",
    "quote": "I came not to call the righteous, but sinners.",
    "quoteCitation": "Mark 2:13-17",
    "firstReading": "Samuel is asked to find Saul when the tribe of Benjamin seeks a missing donkey. Saul, a handsome and tall young man from a notable family, goes in search. Samuel, instructed by God, meets Saul and privately anoints him with oil, indicating God’s choice of Saul as leader over Israel. Samuel pronounces signs confirming this divine election, and Saul is sent away with instructions and a prophetic seal of office.",
    "secondReading": "",
    "psalmSummary": "The psalm celebrates the king’s joy and God’s victorious favor: the Lord grants the desires of the king’s heart and crowns him with glory. The psalmist praises God for answered prayer and protection, recounting the king’s strength in victory and the Lord’s enduring steadfastness. It recognizes God’s faithfulness as the foundation of the ruler’s success and the people's rejoicing.",
    "gospelSummary": "In Mark 2:13–17 Jesus calls Levi the tax collector as he passes by, saying simply, “Follow me.” Levi responds by hosting a meal for Jesus, inviting many tax collectors and others labeled as sinners. Observing this, some scribes and Pharisees question why Jesus eats with such people. Jesus answers that he has come not for the righteous but for sinners, using the image of a physician who cares for the sick. The episode highlights Jesus’ openness to the marginalized, the call to discipleship coming to unexpected people, and a formative ministry rooted in mercy rather than ritual purity alone.",
    "saintReflection": "Saint Anthony of Egypt heard Christ’s call to renounce possessions and follow him, giving away his inheritance and withdrawing into the desert. Through ascetic struggle and spiritual combat he became a living witness to conversion and holiness. Antony’s solitary life attracted disciples and shaped early monasticism; his brief public interventions showed a balance of contemplative prayer and pastoral courage. He exemplifies radical discipleship: detachment, vigilance against temptation, and fidelity to the call to follow Christ.",
    "dailyPrayer": "Lord Jesus, you call the unexpected and embrace the overlooked. Grant me courage to hear your summons and leave behind what holds me back. Give me a heart ready to receive mercy and to extend it, that I may sit with those in need of your healing. Like Levi, may I respond without hesitation; like Anthony, may I pursue prayerful conversion and simplicity. Strengthen me against temptation, guide me in humility, and shape my life for service. Help your Church to remain a refuge for sinners and a beacon of your compassionate love. Amen.",
    "theologicalSynthesis": "These readings gather around a single theological motif: God’s sovereign initiative in calling and transforming persons. In Samuel, divine election of Saul shows God raising leaders by grace beyond human calculation. The psalm frames such leadership as an effect of God’s favor and fidelity, praised in communal worship. Mark’s Gospel brings the theme to Christological focus: Jesus calls sinners like Levi and sits among them, embodying God’s mercy made flesh. Saint Anthony manifests the call’s interior consequence — radical conversion, withdrawal for prayer, and spiritual struggle. Together they teach that vocation involves both a divine summons and a personal response of repentance, mercy, and persistent fidelity. The Church’s ministry must mirror Christ’s mission: to seek, heal, and reform lives through mercy, while leaders serve with humility under God’s authority.",
    "exegesis": "Introduction: The appointed readings for this day present a compact narrative of calling, response, and the consequences of God’s initiative in human affairs. From Samuel’s prophetic anointing to Mark’s portrayal of Jesus’ controversial table fellowship, the texts invite reflection on how God chooses leaders and how those called must live out conversion. Saint Anthony’s life supplies an embodied response to the Gospel’s summons, while the psalm provides the liturgical language by which the community praises God’s saving action.\n\nContext: The first reading (1 Samuel 9:1–4, 17–19; 10:1) sits at a turning point in Israel’s history. Samuel, the last of the judges and the prophet who hears God’s word, is the one who identifies and anoints Saul as Israel’s first king. The narrative stresses both human search and divine appointment: a practical quest for lost animals furnishes the occasion for God’s revelation of a new political order. Saul’s outward qualities — his stature and family standing — are noted, yet his selection is ultimately God’s doing, sealed by prophetic signs and a private anointing with oil. The text underscores the interplay of the ordinary and the sacred: God’s purposes break into everyday life.\n\nPsalm: Psalm 21 (selected verses) frames the king’s success as a gift from Yahweh. The psalmist attributes victory, answered prayer, and exaltation to God’s favor rather than human prowess. The image of crowning and triumph resonates with royal ideology, but the theological point is that God is the source of honor and deliverance. For the community, such a psalm becomes a liturgical reflection on how divine providence directs the fortunes of rulers and people alike; praise and trust are therefore appropriate responses.\n\nGospel: Mark 2:13–17 compresses several theological lines into a simple scene. Jesus’ call of Levi models vocation as both unexpected encounter and immediate response. Levi’s hospitality — bringing others labeled as ‘sinners’ to eat with Jesus — furnishes the setting for a teaching moment about the nature of Jesus’ mission. The Pharisees’ objection focuses on purity and social boundaries; Jesus reframes the issue in terms of mercy, using the metaphor of a physician to justify his table fellowship. Here the kingdom’s arrival subverts the insider/outsider distinctions of the prevailing religious establishment and places compassion at the heart of ministry.\n\nSaints: The life of Saint Anthony of Egypt brings a dramatic, ascetical counterpoint to the communal scenes in the readings. After hearing the Gospel call to sell all and follow, Anthony embraced solitude, spiritual combat, and the disciplined pursuit of holiness. His withdrawal into the desert was not escapism but a radical means of responding to Christ’s summons. Antony’s example shows that vocation can require both detachment from worldly securities and sustained interior struggle. Yet his later role as spiritual father and advisor indicates that solitary fidelity can generate communal fruit, producing disciples and institutions that shape Christian life.\n\nToday: The theological and pastoral questions raised by these readings remain pressing. Who are the ‘sinners’ at whose table we must sit? How do leaders exercise authority as service under God’s providence? In a world marked by social fragmentation and moral complexity, the texts call the Church to a posture of mercy without abandoning moral integrity. The call to conversion is both communal and personal: communities must create spaces where those burdened by sin find healing, while individuals — like Saul, Levi, and Anthony — must respond to God’s initiative with trust, repentance, and perseverance. Pastoral ministry that mirrors Christ’s hospitality will prioritize outreach, repentance, and formation, trusting that God alone crowns human effort with lasting fruit.\n\nConclusion: The readings weave a narrative of divine initiative and human response. God chooses and equips; the proper response is not merely social conformity but transformed life expressed in mercy, prayer, and right leadership. Whether in the desert cell or around a common table, the Christian vocation is to follow the one who comes for sinners, to be healed, and to become instruments of that same healing for others.",
    "tags": [
      "saint-anthony-of-egypt",
      "call",
      "vocation",
      "mercy",
      "repentance",
      "leadership",
      "saint-anthony",
      "tax-collectors",
      "anointing"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/011726.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "Memorial",
    "gospelReference": "Mark 2:13-17",
    "firstReadingRef": "1 Samuel 9:1-4, 17-19; 10:1",
    "secondReadingRef": "",
    "psalmRef": "Psalm 21:2-3, 4-5, 6-7",
    "gospelRef": "Mark 2:13-17",
    "lectionaryKey": "2026-01-17:1 Samuel 9:1-4, 17-19; 10:1||Psalm 21:2-3, 4-5, 6-7|Mark 2:13-17"
  },
  {
    "date": "2026-01-18",
    "quote": "Behold the Lamb of God who takes away the sin",
    "quoteCitation": "John 1:29-34",
    "firstReading": "Isaiah 49:3, 5-6 presents the Servant as one formed and honored by God and charged with a universal mission. The Servant’s vocation is both to restore Israel and to be a light to the nations; his calling is meant to gather the scattered, bring Jacob back, and make God’s salvation known to the ends of the earth. The passage widens the servant’s role beyond national restoration to an inclusive, missionary purpose.",
    "secondReading": "Paul opens 1 Corinthians 1:1-3 with his apostolic greeting to the Corinthian community, naming Sosthenes and invoking God’s grace. He blesses them with grace and peace from God the Father and the Lord Jesus Christ. The brief salutation underscores apostolic authority, the divine origin of Paul’s ministry, and the spiritual gifts that mark the life and identity of the church as a community sustained by grace.",
    "psalmSummary": "Psalm 40:2, 4, 7-8, 8-9, 10 recounts God’s timely deliverance and the psalmist’s response of trust and obedience. Having been lifted from a desperate place, the singer now proclaims a new song and invites others to trust in the Lord. Verses 7–10 stress interior submission—God’s will written on the heart—and a public commitment to speak and act God’s justice and faithfulness, bearing witness to God’s saving works.",
    "gospelSummary": "In John 1:29-34 John the Baptist identifies Jesus as the Lamb of God, declaring that he takes away the sin of the world and signaling a sacrificial, redemptive role. John admits he did not previously know Jesus but was given a sign: the Spirit descending like a dove and remaining on him. That sign verifies Jesus as the Son of God and the one who will baptize with the Holy Spirit. The passage centers witness—John’s testimony—linking baptism, Spirit, and messianic identity and reinterpreting sacrificial imagery in light of Jesus’ vocation.",
    "saintReflection": "Feria: this date is ordinarily marked as a feria, meaning no universal fixed memorial obliges the Church. Devotional calendars sometimes attach optional commemorations, but the absence of a required saint’s feast invites attention to the liturgy itself. The faithful are encouraged to listen attentively to the readings and to honor local or private devotions as appropriate, letting the ordinary pattern of prayer shape Christian life and mission.",
    "dailyPrayer": "Lord God, you call your servants from before birth and send them as light to the nations. Grant us ears to hear your servants’ testimony, like John the Baptist, and hearts ready to recognize Christ when the Spirit reveals him. Make us instruments of your saving work: teach us to trust in your timing, to obey your will written within us, and to proclaim your faithfulness in word and deed. Strengthen your Church with grace and peace through Jesus Christ, who baptizes with the Holy Spirit. Help us live sacrificially for the life of the world until the fullness of your kingdom comes. Amen.",
    "theologicalSynthesis": "The readings form a coherent theological arc: Isaiah’s Servant receives a universal commission, the psalmist responds with trust and public obedience, Paul greets a community shaped by apostolic grace, and John the Baptist’s witness identifies Jesus as the Lamb who inaugurates salvation by the Spirit. Together they present vocation (God’s call), mission (to gather and enlighten), and the means (grace, Spirit, and sacrificial love). The continuity between God’s covenantal sending in Isaiah and the Johannine revelation reframes Israel’s hopes around Jesus’ person and work, while the Church receives that mission in baptism and witness.",
    "exegesis": "Context: The readings for this day gather threads from Israel’s prophetic tradition, the psalmic response of trust, apostolic commissioning, and the Johannine witness. Isaiah 49:3, 5-6 speaks from the mouth of the Servant songs that imagine one uniquely formed and appointed by God to restore Israel and to serve as light for the nations. Psalm 40 covers the experience of rescue and the ethical-musical response of proclamation. Paul’s salutation in 1 Corinthians establishes apostolic authority and grace as the foundation of community. John 1:29-34 places a baptismal and christological interpretation on Jesus’ identity through the sign of the Spirit. Together these readings create a horizon of calling, vindication, and mission that spans covenant history into the church’s present vocation.\n\nFirst Reading: In Isaiah 49:3, 5-6 the Servant is not first named only as Israel’s hope but as one with an expanded purpose. The servant’s mission is paradoxical: intimate formation (from the womb) and public, wide-ranging responsibility (to the ends of the earth). The text reframes chosen-ness as commission: being honored by God entails being sent. The servant’s restoration of Jacob and the enlargement of mission to the nations imply that Israel’s salvation is meant to be a conduit for universal blessing. This prophetic move anticipates later Christian readings that see in the Servant a foreshadowing of Christ’s mission and of the Church’s global vocation.\n\nPsalm: Psalm 40 balances personal testimony and communal summons. The psalmist’s memory of deliverance—pulled out of a pit and given a new song—becomes the basis for ethical commitment and proclamation. Verses 7–10 emphasize interior availability to do God’s will and an outward witness to God’s faithfulness. In the liturgical setting the psalm instructs the community to respond to divine rescue not merely with gratitude but with obedient speech and action. The link between private deliverance and public testimony echoes John the Baptist’s example: one who has seen God’s act must then bear witness so others can trust.\n\nGospel: John 1:29-34 presents a brief but theologically dense scene. John the Baptist’s declaration, calling Jesus the Lamb of God, reframes sacrificial language in light of the one who will enact God’s decisive saving act. The Spirit’s descent like a dove and remaining on Jesus functions as the defining sign for Johannine testimony. John stresses that his recognition of Jesus comes via revelation, not prior personal knowledge. The passage tightly links baptism, the Spirit, and messianic identity, signaling that Jesus’ ministry inaugurates the Spirit’s fuller outpouring and that John’s role is prophetic witness—pointing others to the Messiah.\n\nSaints: The designation Feria on this date highlights how the Church’s calendar preserves ordinary time for the sanctification of daily life. When no obligatory memorial is attached, the readings stand central and invite local devotion. The lack of a fixed universal saint’s feast can itself be a theological reminder: holiness is not confined to named figures but is lived in the ordinary obedience of those called by God to speak and serve. John the Baptist, though not commemorated here as a titular saint of the day, models the prophetic vocation to point beyond oneself to Christ.\n\nToday: The combined message speaks directly to the Church’s identity. We are people called by God, shaped by grace and the Spirit, and sent to make God known. Isaiah’s expansive commission challenges narrow conceptions of mission; the psalm insists on trustworthy testimony; Paul’s greeting roots community in apostolic grace; John’s witness locates the decisive revelation in Christ accompanied by the Spirit. Pastoral application asks Christians to attend to recognition—how we discern Christ in our midst— to the centrality of Spirit-baptism for mission, and to a life of obedient speech and service that echoes the Servant’s vow to bring salvation to all peoples.",
    "tags": [
      "feria",
      "lamb-of-god",
      "mission",
      "servant",
      "baptism",
      "spirit",
      "witness",
      "ordinary-time"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/011826.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "",
    "gospelReference": "John 1:29-34",
    "firstReadingRef": "Isaiah 49:3, 5-6",
    "secondReadingRef": "1 Corinthians 1:1-3",
    "psalmRef": "Psalm 40:2, 4, 7-8, 8-9, 10",
    "gospelRef": "John 1:29-34",
    "lectionaryKey": "2026-01-18:Isaiah 49:3, 5-6|1 Corinthians 1:1-3|Psalm 40:2, 4, 7-8, 8-9, 10|John 1:29-34"
  },
  {
    "date": "2026-01-19",
    "quote": "Obedience is better than sacrifice; rebellion is like divination.",
    "quoteCitation": "1 Samuel 15:16-23",
    "firstReading": "Samuel confronts King Saul after the king spares enemy spoil and claims he intended sacrificial use. Saul’s excuse — that the best animals were kept to honor the Lord — meets Samuel’s firm rebuke: God prefers obedience to ritual offerings. Samuel equates rebellion with divination and stubbornness with idolatry, and declares that because Saul rejected God’s command, the Lord rejects him as king. The passage emphasizes covenant fidelity over religious pretense.",
    "secondReading": "",
    "psalmSummary": "The psalm speaker insists that God does not need external offerings—God owns all creatures—and rebukes those who presume God’s blessing while persisting in wrongdoing. Empty ritual is exposed when coupled with a life of injustice. The text calls the faithful to authentic thanksgiving and humble repentance, promising that true honoring of God through gratitude and transformed life is the right worship God seeks and the basis for divine favor.",
    "gospelSummary": "When asked why his disciples do not fast like others, Jesus answers with images that underline the novelty of his presence and ministry. He compares the present time to a wedding feast when guests do not fast while the bridegroom is present; fasting will come when the bridegroom is taken away. He then gives two analogies about incompatibility: new cloth on an old garment and new wine in old wineskins, showing that the new reality he inaugurates requires fresh forms, not improvised fixes grafted onto old structures.",
    "saintReflection": "Feria denotes an ordinary weekday in the liturgical year without a universal saintal celebration; some local calendars honor regional martyrs or patrons. This lack of a titular feast invites attention to the daily discipline of discipleship. The readings for today direct believers away from outward show and toward interior fidelity: the ordinary days of the Church’s life are opportunities for conversion, obedience, and thankful worship just as much as solemn commemorations.",
    "dailyPrayer": "Lord God, you call us to obedience that springs from love rather than to pious displays that hide rebellion. Grant me humility to hear your word and the courage to obey even when your will runs counter to my excuses. Teach me true worship: a grateful heart, sincere repentance, and practical mercy toward others. As your Son taught, may the newness you bring reshape my forms and practices so that my fasting, prayer, and giving flow from union with Christ. Make me attentive to your presence in ordinary days and faithful in small duties; transform my intentions so that my life becomes genuine praise. Through Christ our Lord. Amen.",
    "theologicalSynthesis": "The readings present a consistent theological claim: external rites alone cannot substitute for interior fidelity to God’s covenant. Samuel’s rebuke of Saul centers on obedience as the proper response to God’s command, showing that ritual offerings cannot redeem disobedience. The psalm complements this by condemning empty worship and calling for thanksgiving and contrition. In the Gospel, Jesus reframes religious practice, insisting that his presence inaugurates a new reality requiring new forms; fasting and ritual have their place but must respond to relationship, not replace it. Together these texts call Christians to interior conversion, grateful worship, and pastoral prudence in how ancient forms are lived out in the newness of Christ.",
    "exegesis": "Context: The first reading comes from the story of Saul’s failed kingship. Samuel’s confrontation follows Saul’s partial compliance with a divine command against Amalek; Saul spares the king and the best spoils, claiming religious motives. The narrative frames a decisive theological judgment: the monarchy’s legitimacy rests on faithfulness to Yahweh’s word. This text is part of the Deuteronomistic concern for covenant fidelity and serves as a caution against substituting ritual for obedience. Samuel acts as prophet-judge, articulating a standard by which kings and people are judged.\n\nPsalm: The selected psalm verses form a sharp critique of ritualism. The Lord asserts ownership over creation, so sacrifice cannot be a bargaining chip to secure divine favor divorced from right behavior. The psalmist challenges those who appeal to God’s justice while persisting in unjust practices, and urges thanksgiving and contrite hearts as true worship. The theological thrust is that cultic practice must flow from and express a transformed moral life; otherwise it becomes hypocrisy. The psalm offers an ethical theology of worship centered on gratitude and integrity.\n\nGospel: Mark’s short scene addresses questions about fasting and religious discipline. Jesus’ response uses household and wedding imagery to indicate that his presence changes the rhythm and meaning of practices like fasting. While not abolishing ascetic practices, he places them in relation to the reality of the Kingdom and to relational communion with the bridegroom. The two analogies about cloth and wineskins emphasize incompatibility: new divine action cannot be accommodated by merely patching old structures. The passage highlights the pastoral discernment needed when traditions meet covenantal novelty.\n\nSaints: The rubric for a feria—an ordinary weekday—invites us to see sanctity in the routine and in the church’s ordinary worship. Local martyrs or patrons may be commemorated, but the liturgy’s focus remains on formation through daily readings and prayers. The readings chosen for these weekdays often press communal and personal conscience: they trim away religious ostentation and ask whether sacramental and devotional life shapes moral behavior and deepens conversion.\n\nInterpretation: Reading these texts together yields a sustained critique of religious superficiality. Samuel’s moral-theological diagnosis—that disobedience is worse than missing sacrifice—resonates with the psalm’s insistence on thanksgiving and contrition. Jesus’ answer in Mark reframes religious observance: what matters is not mere continuity with past forms but fidelity to the living presence of God in Christ. The common line is covenantal integrity: worship practices are meaningful only when they express and reinforce covenant faithfulness.\n\nToday: Practically, these readings challenge contemporary worshipers and communities. They call pastors and laity to examine whether liturgy and devotion foster conversion, justice, and gratitude, or whether they have become habits that mask complacency. Questions arise: are our communal disciplines (fasting, prayer, almsgiving) sustained by an encounter with Christ, and do they lead to neighbors’ flourishing? The Gospel warns against complacent accommodation; it calls for pastoral creativity so that forms of piety genuinely embody the new life Christ brings.\n\nConclusion: Together, these passages press the church toward authentic worship and moral coherence. Ritual without obedience is hollow; novelty without rootedness risks fracturing tradition; but when practices are renewed by Christ’s presence they nurture repentance, thanksgiving, and faithful action. The liturgy of a feria thus becomes a classroom in conversion: ordinary days shape hearts for the extraordinary gift of God’s covenantal love.",
    "tags": [
      "feria",
      "obedience",
      "sacrifice",
      "ritual",
      "fasting",
      "conversion",
      "mark",
      "1-samuel",
      "psalm-50",
      "feria"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/011926.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "",
    "gospelReference": "Mark 2:18-22",
    "firstReadingRef": "1 Samuel 15:16-23",
    "secondReadingRef": "",
    "psalmRef": "Psalm 50:8-9, 16bc-17, 21 and 23",
    "gospelRef": "Mark 2:18-22",
    "lectionaryKey": "2026-01-19:1 Samuel 15:16-23||Psalm 50:8-9, 16bc-17, 21 and 23|Mark 2:18-22"
  },
  {
    "date": "2026-01-20",
    "quote": "The Son of Man is lord even of the Sabbath.",
    "quoteCitation": "Mark 2:28",
    "firstReading": "God sends Samuel to Jesse of Bethlehem to anoint a new king. Samuel fears Saul’s reaction but obeys. Jesse’s sons pass before Samuel, yet God rejects them because He judges the heart, not outward appearance. The youngest, David, a shepherd tending sheep, is called in, anointed with oil by Samuel, and the Spirit of the LORD comes upon him. Samuel returns to Ramah while David begins his vocation.",
    "secondReading": "",
    "psalmSummary": "These verses celebrate God’s choice of David and the divine support given him. The Lord finds and raises his servant, strengthens him against enemies, and grants him victory and authority. God promises to make him firstborn and highest among kings, establishing his enduring rule and favor. The tone is royal assurance: God’s elective act secures leadership and triumph for the one chosen.",
    "gospelSummary": "When Jesus’ disciples pluck grain while walking on the sabbath, the Pharisees challenge him for permitting what they consider unlawful. Jesus replies by recalling David’s need and the bread he ate, showing mercy and precedent can trump strict ritual interpretation. He then teaches a crucial principle: the sabbath exists for humanity’s good, not as an end in itself. Finally, he asserts his own authority over the sabbath, identifying the Son of Man as lord even of the sabbath.",
    "saintReflection": "Saints Fabian and Sebastian witness unexpected calling and courageous fidelity. Fabian’s surprising election and organization of the Church echo David’s anointing: chosen by God beyond human expectation. Sebastian’s secret care for the persecuted and martyrdom mirror Christ’s service of others at personal cost. Their lives model humble availability to God’s mission and brave defense of the faithful, exemplifying how internal vocation and outward witness cohere.",
    "dailyPrayer": "Lord God, you choose and strengthen whom you will. Give us hearts like David who trust your gaze rather than human acclaim. When we face judgment from others, form us to act with mercy and prudence, following your Son who taught the sabbath’s service to human need. Through the prayers of Saints Fabian and Sebastian, inflame in us zeal for mission and courage in suffering. Make us instruments of care for the weak, faithful to your call in times of trial, and ready to serve your Church. We ask this through Christ our Lord. Amen.",
    "theologicalSynthesis": "Today’s readings invite reflection on divine election, interior judgment, and the priority of human need under God’s law. Samuel’s anointing of David shows God choosing by heart and Spirit rather than appearance. The psalm celebrates the firmness of God’s gift and the power vested in the king. In the Gospel, Jesus reframes sabbath observance: law serves life, and mercy precedes ritual. By claiming lordship over the sabbath he places his mission—healing, feeding, defending—the criterion for rightful observance. The martyrs Fabian and Sebastian embody the consequences of divine calling: sudden election, missionary zeal, and costly fidelity. Liturgically and pastorally, these texts converge to affirm that God’s governance works through interior calling, compassionate law, and the Church’s courageous witness.",
    "exegesis": "Context: Samuel’s mission in 1 Samuel 16:1–13 occurs at a pivotal moment in Israel’s history: the monarchy is transitioning from Saul’s troubled reign toward a dynasty shaped by God’s choice. The narrative stage is intimate and domestic—Bethlehem, Jesse’s household—yet it carries national import. The story contrasts human assessment and divine discernment. Samuel, the prophet and priest, acts as God’s agent but must learn to accept God’s counterintuitive standards. The anointing motif places David within a theological trajectory: God’s election, the Spirit’s empowerment, and the founding of a royal line that will be remembered and interpreted in later Israelite and Christian reflection.\n\nPsalm: The verses from Psalm 89 highlight the theological echo of Samuel’s action by celebrating the Lord’s establishment of his servant’s authority. The psalmist praises divine selection and the tangible results of God’s favor: strength in battle, dominance over enemies, and exaltation among kings. Language of covenantal promise and royal enthronement frames David not merely as a warrior but as the instrument of God’s ordering of Israel. The psalm thereby situates personal election within communal stability—God’s choice secures protection and order for the people.\n\nGospel: Mark 2:23–28 records a brief but dense incident in which Jesus reinterprets sabbath observance. The disciples’ plucking of grain evokes earlier biblical narratives (e.g., David’s eating of consecrated bread) that Jesus cites to justify human need. His teaching—principally that the sabbath was made for humankind and that he, the Son of Man, is lord of the sabbath—reorients the Law around its telos: human flourishing and mercy. In Mark’s fast-moving narrative, this moment clarifies Jesus’ authority to read and fulfill the Law; he is not merely a teacher of pious observance but one who fulfills the Law’s intent by prioritizing life and compassion.\n\nSaints: The memorial of Saints Fabian and Sebastian on this day provides concrete examples of vocation’s unpredictable and costly character. Fabian’s election—presented in tradition with a sign like a dove—resonates with the drama of divine selection in Samuel: God’s chooser often works through surprising signs and choices. Sebastian’s role as a protector and martyr underscores the Gospel’s insistence on solidarity with the vulnerable and courage against unjust powers. Both saints manifest how ecclesial mission sometimes emerges suddenly and demands fidelity that can culminate in suffering. Their witness concretizes the biblical theme that God shapes leaders whose authority is exercised in service and in witness unto death.\n\nTheology: Tying these texts together yields a theological pattern: God’s authority is exercised through interior calling, enlivened by the Spirit, and manifested in service that upholds human dignity. Samuel’s anointing, the psalm’s royal assurance, and Jesus’ claim of lordship over the sabbath all point to a sovereignty that honors persons and subordinates legalism to life-giving ends. The notion of the sabbath as created for humanity reframes the understanding of divine commands: they are means to human flourishing. Christ’s lordship infuses the interpretation of Torah with mercy; the Church’s leaders, following Fabian and Sebastian, are called to govern and serve in that spirit.\n\nToday: Pastoral application calls the community to examine where appearances, prejudice, or rigid legalism obscure God’s choice and the needs of others. Leaders should seek the heart’s discernment rather than public acclaim; the faithful should prioritize compassionate action, especially for those in need. The saints encourage boldness in mission and constancy under persecution. Practically, communities might revisit devotional and disciplinary practices to ensure they serve life and mercy, not merely formality. In worship and ministry, acknowledging Christ as Lord of the sabbath invites ministries that restore dignity and allow people to encounter God’s care through tangible compassion.",
    "tags": [
      "saint-fabian-and-saint-sebastian",
      "election",
      "anointing",
      "david",
      "sabbath",
      "law-and-mercy",
      "martyrdom",
      "mission",
      "providence"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/012026.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "Optional Memorial",
    "gospelReference": "Mark 2:23-28",
    "firstReadingRef": "1 Samuel 16:1-13",
    "secondReadingRef": "",
    "psalmRef": "Psalm 89:20, 21-22, 27-28",
    "gospelRef": "Mark 2:23-28",
    "lectionaryKey": "2026-01-20:1 Samuel 16:1-13||Psalm 89:20, 21-22, 27-28|Mark 2:23-28"
  },
  {
    "date": "2026-01-21",
    "quote": "You come to me with sword and spear and javelin",
    "quoteCitation": "1 Samuel 17:45 (USCCB)",
    "firstReading": "In 1 Samuel 17:32–33, 37, 40–51 David volunteers to face Goliath when others tremble. He rejects Saul’s armor, trusting instead in the Lord’s help, selects five smooth stones and approaches the Philistine. Relying on God’s name rather than human weaponry, David slings a stone that strikes Goliath’s forehead; he then uses the giant’s sword to behead him. The Philistine host breaks and the Israelites pursue them to victory, vindicating David’s faith and God’s power.",
    "secondReading": "",
    "psalmSummary": "Psalm 144 praises God as rock and trainer of the hands for battle, acknowledging divine strength that equips the psalmist for struggle. It celebrates God’s saving power and the deliverance granted to the faithful, recognizing that victories belong ultimately to the Lord. The psalm mixes trust in divine protection with praise for God’s skillful care, portraying God both as warrior and refuge for those who rely upon him.",
    "gospelSummary": "In Mark 3:1–6 Jesus enters the synagogue and encounters a man with a withered hand. The Pharisees watch closely, hoping to accuse him if he heals on the Sabbath. Jesus challenges them with a question about doing good on the sabbath, looks upon them with deep displeasure at their hardness of heart, and restores the man’s hand. The healing is decisive, and the Pharisees, thwarted, immediately plot with the Herodians to destroy Jesus. The scene highlights the clash between mercy and legalism and exposes the moral blindness of Jesus’ opponents.",
    "saintReflection": "Saint Agnes, a young Roman noble who consecrated her virginity to Christ, stands as a model of purity and brave witness. Denounced during the Diocletian persecution, she endured humiliation and torture yet remained serene and faithful, reportedly inspiring conversions even amid her trial. Martyred about age twelve or thirteen, Agnes symbolizes love for Christ stronger than death and is patroness of young girls and consecrated virgins, calling believers to fidelity and courageous witness.",
    "dailyPrayer": "Lord God, you raise up the humble and defend the faithful. Give us the simple confidence of David, who trusted you rather than human armor; grant us the compassion of your Son, who healed in spite of legalistic opposition; and the steadfast fidelity of Saint Agnes, who chose you before all else. When we face fear, strengthen our trust; when we grow hard in heart, soften us toward mercy; when temptation assails our commitments, grant perseverance. May your Holy Spirit equip our hands for the good work you entrust to us, and bring us safely to your life. Through Christ our Lord. Amen.",
    "theologicalSynthesis": "These readings together contrast two ways of relating to God: trust that relies on the Lord’s name and mercy that honors the human person. David’s courage reflects a faith that acts on God’s promises, not on human strength. The psalm frames God as both protector and trainer for battle, acknowledging divine agency in human struggle. Mark’s Gospel confronts religious formalism that values rule-keeping over compassion, while Jesus’ healing restores dignity. Saint Agnes’s martyrdom models a life ordered solely to Christ, showing that true fidelity may demand costly witness. The theological thread is clear: authentic religion trusts God, chooses mercy over rigid legality, and bears witness by love even unto sacrifice.",
    "exegesis": "Context: The first reading sets David against Goliath as a theological contrast between human might and divine deliverance. Samuel’s narrative repeatedly shows God choosing the unexpected instrument—here, a shepherd youth—so that the victory will be attributed to Yahweh rather than military power. The passage thus functions as a test of faith for Israel and as a disclosure of God’s way of acting: overturning expectations so that God’s sovereignty becomes evident. In the ancient Near Eastern setting, the story also destabilizes conventional honor dynamics, praising reliance on God’s name above conventional armaments.\n\nPsalm: Psalm 144 complements the narrative voice by invoking God as both rock and trainer of the hands for battle. The psalmist’s language blends trust with praise: God is refuge and craftsman of human skill. In the present lection, the psalm underscores that military success is not merely human technique but a gift from God. The psalm’s oscillation between warrior imagery and personal trust opens a theological horizon in which God shapes and supports human action without reducing human responsibility.\n\nGospel: In Mark 3:1–6 Jesus confronts a different crisis: the hermeneutical one of Sabbath practice. The synagogue becomes arena for testing his authority. Mark presents a compact drama: a man withered, vigilant enemies, a probing question, an affective reaction from Jesus, and a decisive healing. Jesus’ anger and grief register not mere irritation but prophetic lament over hardened hearts that prioritize law over neighborly care. The plot’s swift turn—healing followed by a murderous conspiracy—reveals how mercy unsettles entrenched systems and elicits hostility from those invested in maintaining control.\n\nSaints: Saint Agnes’s witness echoes both readings. Her youthful vow of virginity and her steadfastness amid persecution align with the biblical motif of God’s choice of the unexpected instrument for divine purposes. Agnes’s martyrdom exposes the cost of fidelity in an environment that demanded conformity to imperial cult and social expectation. Like David, she stands alone before a formidable opponent; like the healed man, she exemplifies restored dignity; like Jesus, she resists a system that would silence authentic witness. Her patronage of young girls and consecrated virgins witnesses to vocational fidelity shaped by love rather than social calculation.\n\nSynthesis: Together the texts press a moral-theological claim: true religious life trusts God’s way, acts in mercy, and bears costly witness. David’s battle is theological more than tactical; the psalm frames God as the source of skill and salvation; Mark’s scene indicts those who let legal observance displace compassion. The saint’s martyrdom dramatizes the existential demand of following God when social pressures and political powers oppose faithfulness. The readings thus form a coherent catechesis on reliance upon God, the primacy of love over ritualism, and the call to courageous fidelity.\n\nToday: In contemporary pastoral life these passages challenge believers against two temptations: reliance on human prestige and hard-hearted formalism. The community is summoned to trust God in weakness, to prioritize acts of mercy even when institutional pressures discourage them, and to support those—especially the young—who respond to a vocational call that may be countercultural. Pastors and faithful alike must cultivate a faith that equips hands for service, hearts for compassion, and communities that protect and honor those who witness to Christ, as Saint Agnes did. The lectionary thus provokes concrete questions: whom will we serve with our hands and how will we resist systems that prefer rule to neighborly love?",
    "tags": [
      "saint-agnes",
      "trust",
      "courage",
      "god's-strength",
      "healing",
      "sabbath",
      "martyrdom",
      "saint-agnes",
      "david-and-goliath",
      "mercy-vs.-legalism"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/012126.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "Memorial",
    "gospelReference": "Mark 3:1-6",
    "firstReadingRef": "1 Samuel 17:32-33, 37, 40-51",
    "secondReadingRef": "",
    "psalmRef": "Psalm 144:1b, 2, 9-10",
    "gospelRef": "Mark 3:1-6",
    "lectionaryKey": "2026-01-21:1 Samuel 17:32-33, 37, 40-51||Psalm 144:1b, 2, 9-10|Mark 3:1-6"
  },
  {
    "date": "2026-01-22",
    "quote": "In God I trust; I will not be afraid.",
    "quoteCitation": "Psalm 56:11 (USCCB)",
    "firstReading": "In these verses from 1 Samuel, the people acclaim David after his victory, provoking Saul’s jealousy as women sing his praises. Saul’s envy grows into lethal intent: he plots to kill David, but David’s friendship with Jonathan and Jonathan’s loyalty intervene. Jonathan warns David of his father’s designs and helps secure David’s safety, pleading with Saul and persuading him temporarily to lay aside the plan to kill David.",
    "secondReading": "",
    "psalmSummary": "Psalm 56 is a lament that moves quickly to trust. The psalmist cries out to God under threat, pleading for mercy and deliverance from those who pursue him. Despite fear and enemies, the psalmist recalls God’s help, commits to praise, and professes steadfast trust: God is the refuge, and human power cannot prevail against divine care. The tone shifts from urgent petition to confident praise.",
    "gospelSummary": "Mark 3:7-12 depicts Jesus withdrawing from immediate conflict while vast crowds pursue him from many regions. People sought healing and relief; so many pressed around him that he could barely move. Jesus healed the sick and drew out unclean spirits, which recognized him as the Son of God and cried out. Jesus sternly forbade these spirits from proclaiming his identity, controlling revelation about his messiahship even as his authority over evil and compassion for the suffering become manifest.",
    "saintReflection": "Saint Vincent of Saragossa, a deacon martyred under Diocletian around 304, exemplifies steadfast service and fearless fidelity. He refused to surrender sacred books or renounce Christ despite savage torture, fire, and imprisonment. Early accounts highlight his joyful courage and constancy in witness; he is venerated as a model deacon and the protomartyr of Spain. (See: https://www.franciscanmedia.org/saint-of-the-day/saint-vincent-of-zaragossa/.)",
    "dailyPrayer": "Lord Jesus, in the midst of danger and misunderstanding teach us the calm trust of the psalmist and the courageous fidelity of your servants. When envy or hostility threatens our brothers and sisters, grant us the prudence of Jonathan and the constancy of Saint Vincent to protect and proclaim your truth. Heal the sick, console the fearful, and cast out the spirits that seek to dominate human hearts. Give us the humility to be instruments of your mercy, the courage to keep your word safe, and the patience to wait on your timing. Strengthen our trust so that we may say with confidence, \"In God I trust; I will not be afraid,\" and so bear witness to your Gospel in word and deed. Amen.",
    "theologicalSynthesis": "The readings gather around two complementary responses to threat: trust and witness. Saul’s jealousy threatens David, yet friendship and covenantal fidelity preserve life; the psalmist turns fear into confident reliance on God; Jesus heals large crowds and exorcises demons while controlling revelation of his identity. Saint Vincent’s martyrdom shows witness sustained under persecution, refusing to barter sacred truth for safety. Together they frame discipleship as trust under trial, active care for others, and the courageous preservation of God’s word. The Christian call is both refuge in God and willing, sometimes costly, testimony.",
    "exegesis": "Context: The Day’s readings fall in Ordinary Time but ring with intense interpersonal and spiritual conflict. In 1 Samuel, Saul’s kingship unravels as David rises in popularity; deep social emotions—praise, jealousy, rivalry—drive the narrative. The psalm responds to personal threat with liturgical language of petition and praise. Mark’s Gospel situates Jesus amid overwhelming human need and demonic confrontation, revealing his authority and the complicated management of his messianic identity. The martyrdom of Saint Vincent reminds the reader that faithfully safeguarding the Scriptures and serving the bishop can demand the ultimate sacrifice. Together, these texts explore how faith is tested in both private hostility and public ministry.\n\nPsalm: Psalm 56 frames fear and prayer in a testimony of trust. The psalmist articulates anxiety—his enemies are many and powerful—but pivots to remembrance: God has acted and will act. This movement from lament to trust is the psalm’s theological heart. Liturgically, the psalm teaches the community how to confess fear without despair, to cry out for mercy while committing to future praise. The line summarized in our short quote encapsulates the psalm’s transformation: trust in God breaks the power of terror and reorients the faithful toward praise.\n\nFirst Reading: 1 Samuel 18–19 captures the tragic psychology of Saul, whose insecurity and fear of being displaced by David generate murderous intent. The narrative also models faithful relationships: Jonathan’s loyalty to David is shaped by a covenant that transcends dynastic rivalry. Jonathan’s intervention—warning David and pleading with Saul—shows how personal fidelity can protect life and preserve God’s purposes. The story challenges leaders and citizens alike to examine how praise, envy, and the fear of losing power can corrode justice and mercy within a community.\n\nGospel: Mark 3:7–12 places Jesus in the midst of overwhelming popular expectation and spiritual confrontation. The crowds from Galilee to Tyre and Sidon reflect the wide-reaching effects of Jesus’ ministry; the healing ministry attracts people from diverse regions, suggesting the universal scope of God’s compassion. Mark’s detail that unclean spirits recognize Jesus’ identity—calling him the Son of God—contrasts sharply with human misunderstanding of his mission. Jesus’ injunction to silence about his identity (the so-called Messianic Secret) indicates his control over the timing and character of revelation, preventing superficial popularity that could derail the path to the cross. The passage thus affirms divine authority over evil and discloses the tension between immediate acclaim and the deeper work of salvation.\n\nSaints: Saint Vincent’s witness provides a concrete example of the Gospel call to protect sacred things and to remain faithful when faithfulness costs dearly. As a deacon, Vincent served the bishop and the community, literally defending the Scriptures against coercion; his refusal to surrender the sacred books links him directly to the textual and sacramental life of the Church. His joyful endurance under torture reframes suffering as participation in Christ’s own suffering and as testimony—martyrdom in the classical sense. Vincent’s example nuances the readings’ themes: fidelity is not only a matter of trust but also of active stewardship of God’s word and care for the community, even unto death.\n\nToday: Contemporary believers meet these same dynamics—fear of loss, the allure of popularity, threats to truth, and pressure to compromise. The texts invite personal and communal reflection: Do we, like the psalmist, turn fear into trust? Do we, like Jonathan, risk relationship to protect the vulnerable? Do we, like Vincent, value the Scriptures and the Church’s ministry enough to defend them nonviolently? Finally, do we, like Jesus, exercise authority with compassion and discernment about how and when truth should be proclaimed? The readings propose a balanced discipleship: trust in God, courageous stewardship of truth, compassionate action toward the suffering, and prudent proclamation of Christ’s identity. This synthesis equips a Church that can withstand envy, bear witness under pressure, and heal a world pressed by need.",
    "tags": [
      "saint-vincent-of-saragossa",
      "trust",
      "fear",
      "david",
      "saul",
      "healing",
      "exorcism",
      "martyrdom",
      "saint-vincent",
      "witness",
      "scripture"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/012226.cfm",
    "cycle": "Year B",
    "weekdayCycle": "Cycle II",
    "feast": "Optional Memorial",
    "gospelReference": "Mark 3:7-12",
    "firstReadingRef": "1 Samuel 18:6-9; 19:1-7",
    "secondReadingRef": "",
    "psalmRef": "Psalm 56:2-3, 9-10a, 10b-11, 12-13",
    "gospelRef": "Mark 3:7-12",
    "lectionaryKey": "2026-01-22:1 Samuel 18:6-9; 19:1-7||Psalm 56:2-3, 9-10a, 10b-11, 12-13|Mark 3:7-12"
  }
]