[
    {
        "week": "August 4-10, 2025",
        "days": [
            {
                "date": "2025-08-04",
                "first": "Numbers 11:4-15\n\n4 The mixed multitude that was among them lusted exceedingly. And the children of Israel also wept again and said: Who will give us flesh to eat? 5 We remember the fish that we ate freely in Egypt, the cucumbers and the melons and the leeks and the onions and the garlic; 6 But now our soul is dried up; there is nothing at all, except this manna, before our eyes. ... 15 If this is the way you will deal with me, I beg you to kill me at once, if I have found favor in your sight; and let me not see my wretchedness.",
                "psalm": "Psalm 81:12-17\n\n12 So I gave them up unto their own hearts' lust; and they walked in their own counsels. 13 Oh that my people had listened unto me, and Israel had walked in my ways! 14 I should soon have subdued their enemies, and turned my hand against their adversaries. 15 The haters of the Lord should have submitted themselves unto him: and their time should have endured forever. 16 He should have fed them also with the finest of the wheat: and with honey out of the rock should I have satisfied you.",
                "second": null,
                "gospel": "Matthew 14:13-21\n\n13 Now when Jesus heard this, he withdrew from there in a boat to a deserted place by himself. But when the crowds heard it, they followed him on foot from the towns. ... 20 And they all ate and were satisfied. And they took up twelve baskets full of the broken pieces left over. 21 And those who ate were about five thousand men, not counting women and children.",
                "usccbLink": "https://bible.usccb.org/bible/readings/080425.cfm"
            },
            {
                "date": "2025-08-05",
                "first": "Numbers 12:1-13\n\n1 And Miriam and Aaron spoke against Moses because of the Cushite woman whom he had married: for he had married a Cushite woman. 2 And they said: Has the Lord indeed spoken only with Moses? Has he not spoken also with us? And the Lord heard it. ... 13 And Moses cried unto the Lord, saying: Heal her now, O God, I beseech thee.",
                "psalm": "Psalm 51:3-7,12-13\n\n3 For I know my transgressions: and my sin is ever before me. 4 Against you, you only, have I sinned, and done what is evil in your sight. ... 12 Restore to me the joy of your salvation, and uphold me with a willing spirit. 13 Then I will teach transgressors your ways; and sinners shall return to you.",
                "second": null,
                "gospel": "Matthew 14:22-36\n\n22 Immediately Jesus made the disciples get into the boat and go before him to the other side, while he dismissed the crowds. ... 33 And those in the boat worshiped him, saying, \"Truly you are the Son of God.\" ... 36 And as many as touched the fringe of his garment were made well.",
                "usccbLink": "https://bible.usccb.org/bible/readings/080525.cfm"
            },
            {
                "date": "2025-08-06",
                "first": "Daniel 7:9-10, 13-14\n\n9 I watched till thrones were placed, and the Ancient of Days took his seat. His garment was white as snow... 13 I saw in the night visions, and behold, with the clouds of heaven came one like a son of man... 14 And to him was given dominion and glory and a kingdom, that all peoples, nations, and languages should serve him...",
                "psalm": "Psalm 97:1-2,5-6,9\n\n1 The Lord reigns, let the earth rejoice; let the many coastlands be glad! 2 Clouds and thick darkness are round about him; righteousness and justice are the foundation of his throne ... 9 For you, O Lord, are most high over all the earth; you are exalted far above all gods.",
                "second": "2 Peter 1:16-19\n\n16 For we did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ ... 19 And we have the prophetic word made more sure, to which you will do well to pay attention as to a lamp shining in a dark place...",
                "gospel": "Luke 9:28-36\n\n28 Now about eight days after these sayings he took with him Peter and John and James, and went up on the mountain to pray. ... 35 And a voice came out of the cloud, saying, \"This is my Son, my Chosen; listen to him!\" ... 36 And when the voice had spoken, Jesus was found alone. And they kept silence...",
                "usccbLink": "https://bible.usccb.org/bible/readings/080625.cfm"
            },
            {
                "date": "2025-08-07",
                "first": "Numbers 20:1-13\n\n1 And the children of Israel, the whole congregation, came into the wilderness of Zin in the first month... 7 And the Lord spoke to Moses, saying... 11 And Moses lifted his hand and struck the rock twice with his rod... and water came out abundantly, so the congregation and their livestock drank.",
                "psalm": "Psalm 95:1-2,6-9\n\n1 Oh come, let us sing to the Lord; let us make a joyful noise to the rock of our salvation! ... 6 Oh come, let us worship and bow down; ... 8 Harden not your hearts, as at Meribah, as on the day at Massah in the wilderness, 9 when your fathers tested me, though they had seen my work.",
                "second": null,
                "gospel": "Matthew 16:13-23\n\n13 Now when Jesus came into the district of Caesarea Philippi, he asked his disciples, \"Who do people say that the Son of Man is?\" ... 16 Simon Peter replied, \"You are the Christ, the Son of the living God.\" ... 23 But turning, he said to Peter, \"Get behind me, Satan! You are a hindrance to me...\"",
                "usccbLink": "https://bible.usccb.org/bible/readings/080725.cfm"
            },
            {
                "date": "2025-08-08",
                "first": "Deuteronomy 4:32-40\n\n32 For ask now of the days that are past, which were before you... 35 To you it was shown, that you might know that the Lord is God; there is no other besides him. ... 40 Therefore you shall keep his statutes and his commandments ... that you may prolong your days in the land which the Lord your God is giving you...",
                "psalm": "Psalm 77:12-13,14-15,16,21\n\n12 I will meditate on all your work, and muse on your mighty deeds... 14 You are the God who works wonders; you have made known your might among the peoples. 15 With your arm you redeemed your people... 16 When the waters saw you, O God, when the waters saw you, they were afraid...",
                "second": null,
                "gospel": "Matthew 16:24-28\n\n24 Then Jesus told his disciples, \"If anyone would come after me, let him deny himself and take up his cross and follow me... 27 For the Son of Man is going to come with his angels in the glory of his Father... 28 Truly, I say to you, there are some standing here who will not taste death before they see the Son of Man coming in his kingdom.\"",
                "usccbLink": "https://bible.usccb.org/bible/readings/080825.cfm"
            },
            {
                "date": "2025-08-09",
                "first": "Deuteronomy 6:4-13\n\n4 Hear, O Israel: The Lord our God, the Lord is one. 5 You shall love the Lord your God with all your heart and with all your soul and with all your might. ... 13 It is the Lord your God you shall fear. Him you shall serve and by his name you shall swear.",
                "psalm": "Psalm 18:2-4,47,51\n\n2 The Lord is my rock, and my fortress, and my deliverer... 3 I call upon the Lord, who is worthy to be praised, and I am saved from my enemies. ... 47 The Lord lives, and blessed be my rock, and exalted be the God of my salvation— ... 51 who gives great deliverance to his king, and shows steadfast love to his anointed...",
                "second": null,
                "gospel": "Matthew 17:14-20\n\n14 And when they came to the crowd, a man came up to him and kneeling before him said, 15 \"Lord, have mercy on my son...\" ... 18 And Jesus rebuked the demon, and it came out of him, and the boy was healed instantly. ... 20 He said to them, \"Because of your little faith... truly, I say to you, if you have faith like a grain of mustard seed... nothing will be impossible for you.\"",
                "usccbLink": "https://bible.usccb.org/bible/readings/080925.cfm"
            },
            {
                "date": "2025-08-10",
                "first": "Wisdom 18:6-9\n\n6 That night had been foreknown by our fathers, so that, knowing unto what oaths they had given credence, they might all the more be sure of themselves. ... 9 For the just children of good men made sacrifice secretly, and they agreed upon the divine law, that the saints would share good and evil alike; and forthwith they sang the praises of the fathers.",
                "psalm": "Psalm 33:1,12,18-19,20-22\n\n1 Rejoice in the Lord, O you righteous! Praise befits the just. 12 Blessed is the nation whose God is the Lord, the people whom he has chosen as his heritage. ... 20 Our soul waits for the Lord; he is our help and our shield. ... 22 Let your mercy, O Lord, be upon us, as we hope in you.",
                "second": "Hebrews 11:1-2, 8-19\n\n1 Now faith is the assurance of things hoped for, the conviction of things not seen. 2 For by it the men of old received divine approval. ... 8 By faith Abraham obeyed when he was called... 19 He considered that God was able to raise men even from the dead; hence, figuratively speaking, he did receive him back.",
                "gospel": "Luke 12:32-48\n\n32 \"Fear not, little flock, for it is your Father's good pleasure to give you the kingdom... 35 \"Let your loins be girded and your lamps burning... 37 Blessed are those servants whom the master finds awake when he comes... 48 But he who did not know, and did what deserved a beating, shall receive a light beating. Every one to whom much is given, of him will much be required...\"",
                "usccbLink": "https://bible.usccb.org/bible/readings/081025.cfm"
            }
        ]
    }
]