{"date":"2026-01-10","quote":"We know also that the Son of God has come","quoteCitation":"1 John 5:14-21","firstReading":"The First Reading (1 John 5:14-21) assures believers of confident prayer when requests accord with God’s will. It affirms that if God hears us, we can be sure we have what we asked. John emphasizes knowledge of the true one — the Son of God — who has come and given us insight so we may remain in him. He closes with a pastoral warning to keep away from idols.","secondReading":"","psalmSummary":"Psalm 149 calls the faithful to exuberant praise: sing a new song, praise in the assembly, and celebrate with dance and musical instruments. The psalm celebrates the delight God takes in his people, promising honor and victory to the lowly and faithful. It pictures praise as both joyful worship and a communal proclamation of God’s vindicating justice for his devoted ones.","gospelSummary":"In John 3:22-30 the scene shifts to the ministry overlap of Jesus and John the Baptist. Both are baptizing; John is at Aenon near Salim, and some of his disciples become uneasy when people begin following Jesus. John responds with clarity: he is not the Messiah but the one sent ahead of him. Using the bridegroom metaphor, John explains his joy at the increasing ministry of the one he heralded, and expresses a clear humility: the Messiah must increase while his own role diminishes.","saintReflection":"Feria: No obligatory saint’s feast is inscribed on this date in the General Roman Calendar, so the Mass and Office use the weekday texts of the season.[189][193] Devotional or local celebrations may still be observed.","dailyPrayer":"O God, who hears the petitions of those who ask in accord with your will, grant us confidence in prayer and humility in service. Teach us the readiness to rejoice when your work increases, even if our role seems to lessen. Form us by the witness of your Son so that we may recognize and remain in the truth. Fill our hearts with praise like the psalmist, that we might worship you with joy and fidelity, shunning whatever would lead us from you. Keep us from false attachments and lead us to a deeper love of Christ Jesus, in whose name we pray. Amen.","theologicalSynthesis":"Today’s readings present a unity of assurance, worship, and humility. 1 John gives pastoral confidence: prayer aligned with God’s will is heard and grants assurance. The psalm frames communal response in jubilant worship, celebrating God’s delight in and vindication of his faithful. John the Baptist’s testimony in the Gospel models prophetic humility: he rejoices in the one he announced and willingly steps back as the Messiah’s public ministry grows. Together they teach prayerful confidence, joyous praise, and self-giving subordination to God’s plan.","exegesis":"Context: The first reading from 1 John comes from a closing section in which the apostle gathers practical guidance for Christian life grounded in certainty about God and Christ. The immediate context addresses prayer and knowledge: believers are given a measure of assurance when they pray in accordance with God’s will, and John insists on the existential knowledge of the true one, Jesus Christ. This pastoral letter counters confusion and invites the community to live in the light of the Son’s revelation, distinguishing authentic faith from error.\n\nPsalm: Psalm 149 is a hymn of praise intended for communal liturgical use. It summons the community to a new song, bodily and musical celebration, and rejoicing in God’s favor. The psalm balances exuberant worship with a note of justice: God delights in his people and will honor the lowly, while the faithful are depicted as instruments of divine vindication. The celebratory tone does not negate moral seriousness; instead it grounds communal identity in joyful fidelity and hope for God’s righting of wrongs.\n\nGospel: John 3:22-30 presents a brief but theologically rich episode where Jesus’ ministry eclipses that of his precursor, John the Baptist. The narrative highlights baptismal activity and early church dynamics: natural human concern arises among John’s disciples when crowds turn to Jesus. John’s response is instructive: he clarifies his role as forerunner, employs pastoral imagery of the friend at a wedding to describe his joy, and models humble subordination. The passage teaches that prophetic mission finds its fulfillment not in personal acclaim but in bearing witness to One greater than oneself.\n\nSaints: The designation of the day as Feria indicates no obligatory saint’s celebration in the universal calendar, a reminder that sanctity is not confined to celebrated feasts. The ordinary weekday texts provide the Church’s rhythm and theological depth for the faithful. Local or devotional commemorations may still be observed, which reflects the Church’s balance between the universal liturgical structure and the particular piety of communities. The absence of a universal feast centers attention on the readings themselves and on ordinary discipleship.\n\nApplication: Bringing these readings together yields pastoral directions. Christians are encouraged to cultivate prayer that seeks God’s will rather than private preferences; such prayer is accompanied by assurance rooted in God’s faithful listening. Worship must be both joyful and communal, integrating song, movement, and the proclamation of God’s vindicating justice. At the same time, leaders and servants should emulate John’s humility, rejoicing in the growth of Christ’s work beyond personal standing. The life of the believer is thus a blend of confident petition, exuberant praise, and self-effacing witness.\n\nToday: Practically, the day’s texts challenge believers to examine motives in prayer and ministry. Do we ask for the flourishing of God’s will, or for personal gains? Do we rejoice when God’s work grows even if our role diminishes? The psalm invites us to lift our voices together, recognizing that worship reshapes desires. The readings prompt conversion away from idolatrous attachments and toward a faithful recognition of Christ as the true one. In pastoral formation, these texts can shape preaching about prayer, communal worship, and leadership modeled on prophetic humility.","tags":["feria","prayer","confidence","humility","baptism","john-the-baptist","feria","psalm-149","1-john"],"usccbLink":"https://bible.usccb.org/bible/readings/011026.cfm","cycle":"Year B","weekdayCycle":"Cycle II","feast":"","firstReadingRef":"1 John 5:14-21","secondReadingRef":"","psalmRef":"Psalm 149:1-2, 3-4, 5-6a and 9b","gospelRef":"John 3:22-30","lectionaryKey":"2026-01-10:1 John 5:14-21||Psalm 149:1-2, 3-4, 5-6a and 9b|John 3:22-30"}
