{"date":"2026-01-06","quote":"God sent his only Son so we might live.","quoteCitation":"1 John 4:9","firstReading":"John’s letter summons believers to recognize that love is from God and to live as God’s children. Genuine love proves one’s relationship with God; loving others marks Christian identity. The supreme demonstration of divine love is that God sent his only Son into the world so that we might live through him. Love is not merely ethical effort but the originating act of God, calling Christians to mutual self-giving grounded in the Trinity’s initiative and sacrifice.","secondReading":"","psalmSummary":"Psalm 72 prays for a king whose rule establishes justice and care for the poor. The psalmist asks God to grant the ruler right judgment, to defend the afflicted, and to deliver the needy. The king’s reign is pictured as long and fruitful, marked by abundance, peace, and broad dominion. The imagery connects righteous kingship with divine blessing and the flourishing of the vulnerable under just governance.","gospelSummary":"In Mark 6:34-44 Jesus, moved with compassion, teaches the crowd that follows him. As evening approaches the disciples suggest sending people away, but Jesus instructs them to provide food. With five barley loaves and two fish he gives thanks, breaks them, and distributes to all, feeding five thousand men besides women and children. Everyone ate until full, and the fragments filled twelve baskets. The episode highlights Jesus’ providential care, his blessing and distribution, and points beyond itself to abundant, life-sustaining presence.","saintReflection":"Epiphany of the Lord (Solemnity or Feast (date may transfer to Sunday in some countries)): Epiphany commemorates the manifestation of Christ to the nations, symbolized by the visit of the Magi who followed a star to adore the newborn King.[168][171][174] Their gifts—gold, frankincense, and myrrh—honor Jesus as King, God, and suffering Redeemer.[168][171] In many Eastern traditions the feast also celebrates the Lord’s Baptism in the Jordan, when the Father’s voice and the Spirit’s descent revealed the Trinity.[171][174] Epiphany crowns the Christmas season and proclaims Christ as light for all peoples.","dailyPrayer":"Lord God, who revealed your only Son to the nations as the light of salvation, pour out your Spirit upon us that we may recognize Christ in the stranger, attend to the hungry, and give generous praise. As you fed the crowds through your Son’s compassion, teach us to share our gifts so no one goes away empty. Strengthen our faith to see your presence in the weak and to serve without counting cost. Make our communities signs of your justice and peace, that all who search may find the King of glory. Through Jesus Christ, who lives and reigns with you and the Holy Spirit, one God, for ever and ever. Amen.","theologicalSynthesis":"The readings form a coherent theological witness: God’s love initiates salvation (1 John), a righteous reign brings justice (Psalm 72), and Christ’s compassion provides for bodily need (Mark). Epiphany frames these themes universally—God’s self-revelation reaches all nations. The love that sent the Son grounds mission and charity; the kingly justice prayed for in the psalm shows the ethic of that reign; and the feeding miracle models sacramental and communal provision. Together they call the Church to embody Trinitarian love by serving the poor, proclaiming Christ to the nations, and living justice.","exegesis":"Introduction: These readings gather around the theme of divine self-giving that both initiates and sustains covenant life. 1 John asserts that love is not merely a moral ideal but the very sign of being born of God; Psalm 72 articulates the righteous effects of a divinely sanctioned reign; Mark’s feeding narrative displays Jesus’ merciful provision. Placed in the feast of the Epiphany, the texts invite reflection on how God’s revelation to the nations becomes concrete in justice, charity, and sacramental presence.\n\nContext: 1 John 4:7–10 arises in a community defining itself against false teachers who denied central truths about God’s love revealed in Christ. John counters by insisting that love originates in God and that recognition of God is demonstrated by love for others. The passage culminates in a christological claim: God’s initiative—sending the Son—constitutes the defining act of divine love. This is not abstract theology but an ecclesial standard: to confess God is to embody God’s self-gift in communal relations.\n\nPsalm: Psalm 72 petitions God for a ruler whose reign effects justice and protection for the poor and downtrodden. The petitionary tone seeks right judgment and defense of the afflicted, portraying kingship as vocation to uphold the weak. In the light of Epiphany, the psalm’s hopes are read messianically: the ideal king’s reign brings abundance and peace to all nations. Linking royal legitimacy with concern for the vulnerable, the psalm frames political authority as moral stewardship under God’s blessing.\n\nGospel: Mark 6:34–44 recounts the feeding of the five thousand with concentrated markers: Jesus’ compassion, teaching, eucharistic action (giving thanks, breaking, distributing), and abundant leftovers gathered into twelve baskets. Mark’s detail invites both a pastoral and sacramental reading: Jesus’ empathy answers human need, his blessing and breaking anticipate the Lord’s Supper, and the twelve baskets gesture toward the twelve tribes, signaling covenant renewal. The miracle thus manifests the kingly providence prayed for in the psalm and the love John names as God’s own.\n\nSaints: Epiphany commemorates the disclosure of Christ to the nations, traditionally through the Magi whose gifts acknowledge Jesus’ kingship, divinity, and destined suffering. The feast also, in many traditions, remembers the baptismal revelation when Father and Spirit publicly identified Jesus as God’s Beloved. This double emphasis—recognition by Gentiles and Trinitarian revelation—situates the readings’ concerns in the Church’s mission: to witness the universal scope of God’s love and to form communities shaped by Christ’s self-offering.\n\nToday: For contemporary Christians these texts converge into a summons to public and ecclesial witness. John’s insistence that love originates in God challenges communities to test their identity by concrete mutual care, not mere profession. The psalm presses the faithful to advocate structures that protect the poor, while Mark’s feeding models immediate compassionate response and foreshadows sacramental hospitality. Celebrating Epiphany invites believers to see the signs of Christ among strangers and to offer the church’s gifts—material, liturgical, and prophetic—to a world still searching for light. The season calls parishes to combine proclamation with practice: preaching the revelation of Christ while organizing to feed the hungry, defend the vulnerable, and embody the justice of God’s reign in visible ways.","tags":["epiphany-of-the-lord","epiphany","love","compassion","kingship","justice","eucharist","mission","charity"],"usccbLink":"https://bible.usccb.org/bible/readings/010626.cfm","cycle":"Year B","weekdayCycle":"Cycle II","feast":"Solemnity or Feast (date may transfer to Sunday in some countries)","firstReadingRef":"1 John 4:7-10","secondReadingRef":"","psalmRef":"Psalm 72:1-2, 3-4, 7-8","gospelRef":"Mark 6:34-44","lectionaryKey":"2026-01-06:1 John 4:7-10||Psalm 72:1-2, 3-4, 7-8|Mark 6:34-44"}
