{"date":"2026-01-23","quote":"He appointed twelve that they might be with him","quoteCitation":"Mark 3:14 (Mark 3:13-19)","firstReading":"Saul pursues David into the wilderness and enters a cave where David and his men are hiding. David secretly cuts off a corner of Saul’s robe but later reveals himself from a distance to show he could have killed the king yet chose not to. He reproves Saul for hunting him and declares his loyalty and innocence. David presents the torn robe as proof of restraint and trusts God to judge, prompting Saul to acknowledge David’s righteousness and pledge peace.","secondReading":"","psalmSummary":"The psalmist seeks refuge under God’s wings amid danger, pleading that God send steadfast love and faithfulness. Surrounded by hostile foes who scheme and threaten with sword and snares, the psalmist cries out for rescue and protection. Despite the peril, the tone shifts toward confident praise: the heart will sing and give glory. The final petition exalts God above the heavens and affirms divine kingship and mercy over the earth.","gospelSummary":"Jesus goes up the mountain, calls those he wants, and appoints twelve to be his close companions and emissaries. He names them: Simon (Peter), James and John (sons of Zebedee), Andrew, Philip, Bartholomew, Matthew, Thomas, James son of Alphaeus, Thaddeus, Simon the Zealot, and Judas Iscariot. Their appointment has a twofold shape: to be with Jesus (formation in his presence) and to be sent to preach and exercise authority over unclean spirits. The passage highlights both intimacy and mission—community gathered around the Teacher and empowered to participate in God’s healing work, even while it foreshadows betrayal within the group.","saintReflection":"Feria: The universal calendar keeps this day as a weekday of the season, without a required saint’s celebration.[184][193] National calendars, such as that of the United States, may assign optional observances or civic pro-life days around this date.","dailyPrayer":"Merciful God, like David we face enemies and fears; grant us the restraint and courage to refuse vengeance and to trust your justice. Shelter us under your wings when snares close in; give us the steadfast love and faithfulness that sustain hope. Call us, as you called the Twelve, to be with your Son so that we may learn his heart and be sent in his name. Fill us with authority not for domination but for healing, and teach us to witness with humility, even when betrayal or misunderstanding arise. Make our hearts instruments of your peace, our lips proclaimers of your mercy, and our hands ready for service. Through Christ our Lord. Amen.","theologicalSynthesis":"The readings today weave a pattern of mercy, formation, and mission. First Samuel models moral restraint: David refuses to seize kingship by violence, trusting God rather than seizing power. The psalm cries for refuge and pledges praise, balancing human vulnerability and divine sovereignty. Mark’s account of choosing the Twelve frames apostolic ministry as rooted in intimacy with Jesus—formation “to be with him”—and then sending, with authority over evil. Theological life thus moves from being formed by Christ’s presence to participating in his mission. The church learns nonviolent patience, confident prayer, and courageous proclamation, trusting God to vindicate justice while it witnesses to mercy.","exegesis":"Context: The first reading (1 Samuel 24:3-21) belongs to the complex narrative of David’s rise and Saul’s decline. David has been anointed but remains a fugitive pursued by the king. The cave scene at En-gedi presents an ethical test: David has the opportunity to kill Saul, yet he refrains. That restraint is not passive cowardice but a principled refusal to usurp God’s role as judge. In context the episode contrasts human ambition with patient fidelity: David preserves the order of kingship while signalling his trust in God’s timing. The scene also cultivates public credibility for David—he acts as a just future ruler, not a conspirator.\n\nPsalm: Psalm 57 interposes personal peril with doxological confidence. The psalmist’s appeal to shelter under God’s wings evokes asylum language and covenantal protection. Verses 3–4 depict enemies who “prepare a net” and brandish swords, conveying both external threat and treachery. Yet the psalm moves quickly toward praise—singing, playing, and exalting God above the heavens. Theologically this psalm balances lament and trust: prayer petitions divine aid, while praise anticipates deliverance. The closing acclamation unites personal rescue with cosmic sovereignty, inviting the faithful to read danger in light of God’s universal lordship.\n\nGospel: Mark 3:13-19 compresses the origin of the Twelve into a brief, dense statement. Jesus ascends a mountain—a symbolic space of revelation—and “summons” those he wants, emphasizing divine initiative in calling. The two verbs that describe the Twelve’s purpose—“to be with him” and “to be sent out”—sketch a formation-to-mission sequence. Naming the apostles root them in relational intimacy before commissioning them. The gift of authority over unclean spirits locates their mission in conflict with evil; their preaching is not mere instruction but participation in God’s restorative action. Including Judas Iscariot within the list also prepares Mark’s reader for the paradox of apostolic failure within the community.\n\nSaints: The day’s feria status—no obligatory saint’s memorial—functions liturgically as a kind of silence that highlights Scripture and the assembly’s vocation. Where particular saints might model a specific virtue, the absence invites the community to inhabit the readings themselves as formative exemplars: David’s restraint, the psalmist’s refuge-seeking, and the apostles’ formation and sending. National calendars may add memorials or civic observances; such additions should harmonize with the texts’ themes, prompting pastoral responses—prayer, service, and public witness—that embody mercy and mission.\n\nToday: For contemporary Christians the combined witness calls for patient fidelity and prepared witness. David’s example warns against seizing power through violence and invites trust in God’s justice; it challenges believers to eschew revenge and to represent righteous restraint in civic and personal conflicts. The psalm teaches the posture of prayerful dependence—seeking shelter, crying out amid danger, yet turning to song that exalts God even before deliverance. Mark’s commissioning of the Twelve shapes Christian identity: formation in Christ’s presence is prerequisite to effective sending. Our ministries require time with Jesus—prayer, Scripture, sacrament—so that mission issues from communion rather than ambition.\n\nConclusion: Read together, these texts form a spiritual pedagogy: cultivate trust, choose mercy over expedience, let prayer and praise shape your courage, and allow formation in Christ to precede mission. The church is called to resist the logic of domination, to practice restorative authority against evil, and to witness that God vindicates the righteous. In the ordinary cadence of a feria, the faithful are invited to make these readings practical—receiving formation, offering refuge, and going forth to heal in the name of the One who summons and sends.","tags":["feria","ordinary-time","mercy","mission","apostles","david","psalm","feria"],"usccbLink":"https://bible.usccb.org/bible/readings/012326.cfm","cycle":"Year B","weekdayCycle":"Cycle II","feast":"","firstReadingRef":"1 Samuel 24:3-21","secondReadingRef":"","psalmRef":"Psalm 57:2, 3-4, 6 and 11","gospelRef":"Mark 3:13-19","lectionaryKey":"2026-01-23:1 Samuel 24:3-21||Psalm 57:2, 3-4, 6 and 11|Mark 3:13-19"}
