[
  {
    "date": "2025-08-07",
    "quote": "Who do you say that I am?",
    "quoteCitation": "(Mt 16:15)",
    "firstReading": "Numbers 20 recounts Moses striking the rock twice at Meribah; his lapse in trust bars him from the promised land, illustrating the cost of deflected faith.",
    "psalmSummary": "Psalm 95 exhorts hardened hearts to hear the Lord today, not repeating Meribah’s rebellion.",
    "gospelSummary": "Peter professes Jesus as Messiah, yet is immediately schooled in the scandal of the cross, revealing discipleship’s paradox.",
    "saintReflection": "Saint Cajetan, founder of the Theatines, preached reform through evangelical poverty; Pope Sixtus II and companions sealed their witness with blood, valuing Christ above imperial threats.[46]",
    "dailyPrayer": "God of living water, soften our resistance and shape in us an unambiguous confession that endures the cross.",
    "theologicalSynthesis": "Leadership falters when self-reliance replaces obedience; true reform begins where identity in Christ meets sacrificial love—an antidote to today’s cults of charisma and comfort.",
    "exegesis": "The twin scenes of Meribah and Caesarea Philippi expose patterns of impulse: Moses yields to frustration, Peter to messianic triumphalism. Both are corrected—Moses through consequence, Peter through the chilling forecast of passion. Saints Sixtus II and Cajetan answer differently: the former embraces martyrdom; the latter chooses poverty-driven renewal. Contemporary ministers likewise face the crossroads of control or kenosis. The rock that gushes water and the rock named Peter converge in Christ, the cornerstone who alone slakes human thirst.",
    "secondReading": "",
    "tags": [
      "identity",
      "reform",
      "sacrifice"
    ],
    "usccbLink": "https://bible.usccb.org/bible/readings/080725.cfm",
    "cycle": "C",
    "weekdayCycle": "1",
    "feast": "Optional Memorial – Saint Cajetan / Sts. Sixtus II & Companions",
    "gospelReference": "Mt 16:13-23"
  }
]